[
  {
    "id": "jd_000000",
    "text": "Flutter Developer\n\nWe are looking for hire experts flutter developer. So you are eligible this post then apply your resume.\nJob Types: Full-time, Part-time\nSalary: ₹20,000.00 - ₹40,000.00 per month\nBenefits:\nFlexible schedule\nFood allowance\nSchedule:\nDay shift\nSupplemental Pay:\nJoining bonus\nOvertime pay\nExperience:\ntotal work: 1 year (Preferred)\nHousing rent subsidy:\nYes\nIndustry:\nSoftware Development\nWork Remotely:\nTemporarily due to COVID-19",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000001",
    "text": "Django Developer\n\nPYTHON/DJANGO (Developer/Lead) - Job Code(PDJ - 04)\nStrong Python experience in API development (REST/RPC).\nExperience working with API Frameworks (Django/flask).\nExperience evaluating and improving the efficiency of programs in a Linux environment.\nAbility to effectively handle multiple tasks with a high level of accuracy and attention to detail.\nGood verbal and written communication skills.\nWorking knowledge of SQL.\nJSON experience preferred.\nGood knowledge in automated unit testing using PyUnit.",
    "title": "Django Developer",
    "required_skills": []
  },
  {
    "id": "jd_000002",
    "text": "Machine Learning\n\nData Scientist (Contractor)\n\nBangalore, IN\n\nResponsibilities\n\nWe are looking for a capable data scientist to join the Analytics team, reporting locally in India Bangalore. This person’s responsibilities include research, design and development of Machine Learning and Deep Learning algorithms to tackle a variety of Fraud oriented challenges. The data scientist will work closely with software engineers and program managers to deliver end-to-end products, including: data collection in big scale and analysis, exploring different algorithmic approaches, model development, assessment and validation – all the way through production.\n\nQualifications\n\nAt least 3 years of hands-on development of complex Machine Learning models using modern frameworks and tools, ideally Python based.\nSolid understanding of statistics and applied mathematics\nCreative thinker with a proven ability to tackle open problems and apply non-trivial solutions.\nExperience in software development using Python, Java or a similar language.\nAny Graduate or M.Sc. in Computer Science, Mathematics or equivalent, preferably in Machine Learning\nAbility to write clean and concise code\nQuick learner, independent, methodical, and detail oriented.\nTeam player, positive attitude, collaborative, good communication skills.\nDedicated, makes things happen.\nFlexible, capable of making decisions in an ambiguous and changing environment.\n\nAdvantages:\n\nPrior experience as a software developer or data engineer – advantage\nExperience with Big data – advantage\nExperience with Spark – big advantage\nExperience with Deep Learning frameworks (PyTorch, TensorFlow, Keras) – advantage.\nExperience in the Telecommunication domain and/or Fraud prevention - advantage",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000003",
    "text": "iOS Developer\n\nJOB DESCRIPTION:\n\nStrong framework outside of iOS is always a plus\n\niOS experience and generalist engineers with backgrounds in related technologies is a plus\n\nA disciplined approach to development, documentation and file structure\n\nStrong visual design sense and excellent taste\n\nA constant desire to improve, learn more and take things higher\n\nAn excellent understanding of networking, mobile network issues, concurrency and threading\n\nExperience working with internationalized apps\n\nRESPONSIBILITIES\nDesign and build advanced applications for the iOS platform.\nCollaborate with cross-functional teams to define, design, and ship new features..\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nHave published one or more iOS apps in the app store.\nA deep familiarity with Objective-C and Cocoa Touch.\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text.\nExperience with third-party libraries and APIs.\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies.\nSolid understanding of the full mobile development life cycle.\nResponsible for working on different layers of the iOS apps.\nHelp architect and maintain our set of native mobile applications.",
    "title": "iOS Developer",
    "required_skills": []
  },
  {
    "id": "jd_000004",
    "text": "Full Stack Developer\n\njob responsibility full stack engineer – react role make impact petsmart transforming engineering team meet need rapidly changing retail environment role foundational helping build craft petsmart ’ prowess making react j native key framework across mobile web property working across web mobile application part building amazing mobile first customer experience impact customer store digital channel goal responsibility include act full stack developer across petsmart ’ various web mobile solution full stack engineer help build petsmart ’ competency using react j native across mobile web property partner web engineering team strategy share component across application best practice new advancement react community work product ux team review design concept offer suggestion decrease complexity maintaining spirit experience proactively make recommendation technical enhancement better performance scalability maintainability accountable delivering agile environment creates/oversees completion technical development mobile web solution work cross functional business team design develop solution based business requirement identify area improvement design implementation process tooling automated testing quality assurance mentor le experienced developer remain current latest web technology seeking integrate solution appropriate ’ bring table 5+ year hands-on experience web development 2+ year recent experience working react strong experience various j library framework redux angular vue etc expert understanding javascript html cs restful apis http networking concept full stack web development architecture expertise experience mvc object-oriented programming concept experience implementing responsive design adaptive design demonstrated strong front-end development skill especially concerning accessibility extensibility client-side computing object-oriented design pattern object-oriented cs experience sass/less/postcss framework demonstrated passion user experience design usability familiar experienced making use open source component ability address short term tactical requirement without losing site longer range strategic direction self-motivated discipline meet deadline speed accuracy professional attitude excellent written oral communication skill excellent analytical trouble-shooting skill collaborative team player ability resolve conflict constructive manner work around obstacle ensure project success b computer science equivalent team ’ growing faster pace ever investing heavily cutting-edge technology importantly _our people._ petsmart team ’ department valued business partner every area company every level associate empowered come innovative idea strategic impact business ’ take pride work “ ” behind all—for love pet click meet mike goodwin petsmart ’ cio ’ love home office offer outstanding amenity fun rewarding workplace including pet friendly environment bring pet work ! work-life balance family event movie night art event holiday festival “ top dog ” gym equipment fitness class massage therapist personal trainer “ sit & stay ” café serving fresh breakfast lunch option starbucks cart—productivity finest ! “ lil ’ paw ” learning center onsite childcare facility volunteer event petsmart charity submit resume",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000005",
    "text": "Java Developer\n\nSoftware Developer - Integration*\nImmediate Opening!*\nA dynamic Akron / Cleveland area company is looking for an experienced software developer. The Integration Developer designs, develops, tests, maintains and enhances multiple systems serving internal users as well as our suppliers and customers. The Integration Developer interacts with IT and other internal business partners to deliver systems that advance company strategy and improve the enterprise capability of IT.\nCandidates need to demonstrate experience in the following skillsets: *\n· Proven technical expertise in the design, development, coding, testing, and debugging of enterprise software.\n\n· Strong knowledge of web services (WSDL, Soap, Restful).\n\n· Experience working with relational databases.\n\n· Experience authoring and maintaining data access and / or database queries.\n\n· Familiar with standard software design patterns, methodologies, and the MVC architecture.\n\n· Proficient in the following technologies: C#, .NET, .NET Core, HTML5, CSS3, MsSQL, MySQL, ReactJS.\n\n· Experience working with and/or administering Microsoft IIS\n\n· Experience with SYSPRO’s ERP package a plus but not required\nCandidates must be able to execute the following functions: *\n· Creates and deploys code and configuration associated with support and project work across our application portfolio.\n\n· Assists in creating, evolving and standardizing technical processes such as source code management, continuous integration, etc.\n\n· Submits code and configuration with high levels of quality, performance, security, scalability and extensibility.\n\n· Assists in the creation and evaluation of business requirements and project plans.\nOther requirements include: *\n· Takes pride in delivering work on time and with quality\n\n· Good problem solving and decision making abilities\n\n· Ability to learn quickly in a fast-paced environment\n\n· Ability to both work independently and with teams\n\n· Effectively juggles a continuous mix of support and project work\n\n· Able to work off hours / provide on-call support when needed\n\nThe ideal candidate must be a self-starter, able to work independently, and have experience in the skillsets mentioned above. This position requires a highly responsible and organized individual with a good work ethic and a minimum of two years of experience using the tools and technologies noted above.\n\nCompensation is commensurate with experience.\nIndustries* - Manufacturing-Other\nEducation* - Bachelor's Degree in Computer Science, Information Systems, or related field, or combination of education and equivalent work experience.\nJob Type: Contract\n\nExperience:\nSoftware development: 2 years (Required)\nWork Location:\nOne location\nWork Remotely:\nNo",
    "title": "Java Developer",
    "required_skills": []
  },
  {
    "id": "jd_000006",
    "text": "Full Stack Developer\n\nsenior full stack developer \\- 1800026h cwt looking senior full stack developer proven back-end skill well strong front-end skill role ’ use cutting-edge technology help develop next generation business travel solution million user worldwide participate lead architecture review technology standard definition lead effort find implement support new technology framework standard experiment implement propose new process technology develop back-end system designed scale analyze business software requirement develop back-end software test learn new technology broaden tech stack provide tier 3 production support handle live production issue participate develop agile software development process qualification b.sc degree computer science engineering relevant field equivalent industry experience minimum 2 year experience developing following nodejs java experience nosql solution mongodb elasticsearch redis experience react/angular knowledge single-page application spa development advantage experience javascript cs html responsive ui & cross browser advantage experienced developing rich large-scale web application advantage experience developing robust http apis back-end service passion technology building product team player excellent interpersonal skill self-motivated independent learner eligible candidate must valid passport able travel israel 6 week training shortly hired primary location us-il-chicago work home employment type standard job family information technology scope global travel yes 15 time shift day job organization p & t_hotel product experience level 3 5 year job posting may 9 2018 equal opportunity employer/affirmative action employer organization discriminate employment practice due applicant ’ race color religion sex national origin veteran status disability status sexual orientation gender identity federal state local protected class",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000007",
    "text": "JavaScript Developer\n\nJob Description:\n\nReactJS + NodeJs, Azure Functions, and GraphQL capability\n\nStrong hands on experience on javascript frameworks like reactjs\nHaving hands on experience on nodejs\nHands on experience on Azure function and integrations\nStrong hands on experience on HTML5/CSS3/Javascript\nExcellent written and verbal communication.\nKnowledge of REST as well as GRAPHQL\nExperience Range:\n\n3 - 8 years\n\nEducational Qualifications:\n\nAny graduation, and Any PG and Any Doctorate\n\nJob Responsibilities:\n\nImplementing visual components & building rich UI for complex internal and external systems.\nTaking ownership of modules, and building the foundation of new systems which are inline with improved quality, process & productivity\nHave a passion for quality and writing clean, solid, readable code that scales and performs well.\n\nSkills Required :\n\nReactJS, NodeJS, Azure Functions, GraphQL,\n\nJob Code : #KL-DP3PZB64",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000008",
    "text": "DevOps Engineer\n\nMain Responsibilities and Deliverables:\nManage/support the rollout, scalability and execution of the automation as it is consumed by the various teams\nEnsure automation services scales to handle rapid growth\nUsing the automations, establish the ability to measure and optimize system health and performance.\nOn an ongoing basis; configure, tune and troubleshoot automations to achieve optimal application performance and stability\nStrong scripting experience with; Bash, Ruby, Python, Java.\nSolid experience working with commercial grade automated deployment & configuration mgmt. tools such as; Puppet, Chef, Cloudify, CFEngine. (Puppet skills strongly coveted.)\nStrong “hands-on” experience with open source and provisioning tools such as; Cobbler, Foreman, PHP, and Linux or other likewise open source systems, tools /utilities.\nStrong senior level Linux & Windows OS experience & troubleshooting skills\nExperience with application debugging, performance, scalability & capacity planning expertise\nManage full system lifecycle of automations including configuration and code deployment in user acceptance test and production environments\nImprove automated product performance health checks and “self-healing” capabilities in complex highly available Cloud environments.\nParticipates and assists to drive the automation tools roadmap to increase availability, performance and reduce support demands.\nDrive the adoption of Infrastructure as Code in a DevOps oriented organization\nPartner with R&D teams to engineer resilient, supportable and scalable products\nArchitect solutions to leverage the best of Cloud infrastructure\nExperience with tools and software such as Urban Code, Hadoop, Tomcat, Mule, OpenAM and Apache\nExperience with F5 load balancers, networking theory and protocols (TCP/IP, HTTP, NTP, DNS) and hardware components.",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000009",
    "text": "Software Engineer\n\nOverview\n\n\nBased in Silicon Valley, Tintri is a wholly owned subsidiary of DataDirect Networks (DDN.com), the data-at-scale powerhouse and world’s largest privately held storage company. Tintri solutions serve the needs of enterprise data centres with intelligent infrastructure. Our product portfolio includes advanced technologies from Tintri (acquired September 2018), Nexenta (acquired May 2019), and IntelliFlash (acquired from Western Digital November 2019). This portfolio offers a fresh choice and a new experience to elevate your user experiences through automation, analytic insight, and tight integration with application workflows for your enterprise applications, including mission-critical databases and business applications, virtualization, and flexible software defined solutions. Learn more about the Tintri portfolio of solutions at https://www.tintri.com/products\n\nTintri is looking for motivated and passionate individuals that are self-motivated in their work and careers but we are valuing and thriving in an environment where collaboration and teamwork are at best. We are all together on a quest to provide game changing storage solutions.\n\nJob Description\n\n\nJob Location: Pune\n\nRED Senior Software Engineer – REST API Dev\n\nJob Description\n\nResponsibilities:\n\nWe are looking for a Senior Software Engineer for our RED Tintri Storage engineering team who will design, build and deliver the configuration and deployment tools of DDN RED software storage product:\nParticipate in the definition and implementation of the RED REST API allowing to configure, deploy and manage the RED solution on premises and on cloud.\nParticipate in the system tools definition and implementation providing interaction with the storage deployments to perform analytics and provide value-added services to customers and users.\nDevelopment competencies:\nKnowledge of REST API\nStrong experience in developing and debugging C/C++ for Linux/Unix\nExperience in developing with Python, Go\nExperiences with Git, Gerrit and Jenkins\nVery good written/verbal communication skills in English\nThe ideal candidate has knowledge of and experience in several of the following subjects:\nKnowledge of configuration and deployment large systems on cloud or on premise\nKnowledge of deployment on VMs and containers\nKnowledge of development or utilization of control or data plane API for systems' management\nSkills and Experience:\nMinimum 7 years of software development experience\nExcellent written/verbal communication skills\nExcellent time management skills, with the ability to independently prioritize, multitask, and work under deadlines in a fast paced environment\nStrong interpersonal skills and ability to interact effectively with program staff\nStrong team player\nHighly effective analytical, problem solving, decision making and influencing capabilities\nStorage industry experience desired.\nMinimum of BS or MS; computer engineering, computer science or related technical field.",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000010",
    "text": "Database Administrator\n\nrichardsontexasunited state bausp4 boeing company currently seeking database administrator join 's richardson texas location responsibility include limited following partner customer gather document requirement produce product specified customer must able work across diverse team software system engineer training development specialist software technician security specialist dynamic high-paced environment must able successfully develop plan establish database performance baseline ; monitoring performance trend identify correct problem ; customizing existing application life project must able assure curriculum integrity security configuration management version control must able collaborate architect technical specialist identify proper hardware software upgrade implementation must able plan install test software upgrade patch must implement database security infrastructure manages user account must work closely project manager database programmer multimedia program develop implement customer ’ learning management system business system development environment must prepare database documentation including standard procedure definition deliverable data dictionary metadata boeing world 's largest aerospace company leading manufacturer commercial airplane defense space security system engineer technician skilled scientist thinker bold innovator dreamer join u build something better customer world typical education/experience technical bachelor 's degree typically 9 year ' related work experience master 's degree typically 7 year ' phd degree typically 4 year ' related work experience equivalent combination education experience technical degree defined four year degree greater mathematic scientific information technology field study basic qualification required position requires active ability obtain u.s. security clearance u government requires u citizenship position requires active top secret clearance security clearance/special program access government access requirement mandatory position much work boeing company classified nature many position require security clearance granting discretion government authority applicant must current top secret security clearance additionally applicant must able obtain program access security clearance upgrade and/or program access request initiated applicant 's acceptance contingent offer filling requisition contingent based applicant 's ability obtain required program access time frame established program management relocation dallas texas authorized appropriate access granted must advanced sql/oracle database design administration knowledge able write script query system generate customer report desired qualification knowledge ibm rational clearcase bnh advisor enterprise ; yes 10 time commercial derivative aircraft individual contributor standard united state ; boeing company",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000011",
    "text": "Machine Learning\n\nRemote, Any where\n2 - 4 years\n₹8L - ₹12L / yr (ESOP available)\nSkills\nTensorFlow\nOpenCV\nPython\nArtificial Neural Network (ANN)\nDeep Learning\nImage Processing\nPyTorch\nAmazon Web Services (AWS)\nCloud Computing\ncomputer vision\nJob description\nClearQuote app helps assess damages in cars based on images/videos - used by insurers, mobility providers and workshops.\n\nWhat’s on offer – Opportunity to lead development of a global tech product, competitive pay and stock options\n\nRole\n1) Work on identifying and implementing pre-processing of various datasets (images, videos)\n2) Identifying / testing the right techniques / deeplearning libraries to use to train the model and infer parts and degree of damage in test data\n3) Deploy training and inferencing models on cloud (and edge if required)\n4) Work on improving accuracy of detection\n5) Based on experience and ability - lead the rest of the computer vision engineering team\n\nRequirements:\n\n1)Experience in Deep learning using Convolutional Neural Networks\n2)Sound knowledge of Object detection,Semantic segmentation,Instance segmentation(Faster-RCNN,Single shot multibox detector(SSD),Mask RCNN,Mobile-net)\n3)Classic Image processing techniques using OpenCV\n4)Proficiency in Python\n5)Should be comfortable building ML models on various deep learning and machine learning libraries using tensorflow,keras,scikit-learn,Numpy,etc\n6)Familiarity with Amazon Web service( Elastic Cloud Compute(EC2),Amazon Sagemaker) and deployment\n7)Must have work experience in image processing, computer vision areas (exposure to other machine learning / deep learning areas a bonus)\n8) Experience in working with Pytorch preferred\n9) Strong basics in machine learning, computer vision\n10) Prior experience in implementing research papers into production models\n11) Experience in startup environment is preferred",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000012",
    "text": "Machine Learning\n\nExcited by Big Data, Machine Learning and Predictive Software? Interested in creating new state-of-the-art solutions using Machine Learning and Data Mining techniques on Terabytes of Data?\nAt Amazon, we are developing state-of-the-art large-scale Machine Learning Services and Applications on the Cloud involving Terabytes of data. We work on applying predictive technology to a wide spectrum of problems in areas such as Amazon Retail, Seller Services, Customer Service, Alexa, Chatbots and so on. We are looking for talented and experienced Machine Learning Scientists (Masters/Ph.D. in a related area preferred) who can apply innovative Machine Learning techniques to real-world e-Commerce problems. You will get to work in a team dedicated to advancing Machine Learning technology at Amazon and converting it to business-impacting solutions.\nMajor responsibilities\n- Use machine learning, data mining and statistical techniques to create new, scalable solutions for business problems\n- Analyze and extract relevant information from large amounts of Amazons historical business data to help automate and optimize key processes\n- Design, develop and evaluate highly innovative models for predictive learning\n- Establish scalable, efficient, automated processes for large scale data analyses model development, model validation and model implementation\n- Research and implement novel machine learning and statistical approaches\n\n\n\n\nBasic Qualifications\n\n- A Masters and/or PhD in Computer Science, Machine Learning, Operational research, Statistics or in a highly quantitative field\n- Experience in predictive modelling and analysis, predictive software development\n- Strong problem-solving ability\n- Good skills with Java/Scala or C++, Perl/Python (or similar scripting language)\n- Experience in using R, Matlab, or any other statistical software\n- Strong communication and data presentation skills\n\n\n\nPreferred Qualifications\n\n- Experience handling gigabyte and terabyte size datasets\n- Experience working with distributed systems and grid computing\n- Knowledge of the latest and state of the art ML technology\n- Publications or presentation in recognized Machine Learning and Data Mining journals/conferences",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000013",
    "text": "Software Engineer\n\nAs a member of our Software Engineering Group you will dive head-first into creating innovative solutions that advance businesses and careers. You'll join an inspiring and curious team of technologists dedicated to improving the design, analytics, development, coding, testing and application programming that goes into creating high quality software and new products. You'll be tasked with keeping the team and other key stakeholders up to speed on the progress of what's being developed. Coming in with an understanding of the importance of end-to-end software development-such as Agile frameworks-is key. And best of all, you'll be working with and sharing ideas, information and innovation with our global team of technologists from all over the world. JPMorgan Chase & Co. is an equal opportunity employer and affirmative action employer Disability/Veteran\n\nThis role requires a wide variety of strengths and capabilities, including:\nAdvanced knowledge of application, data and infrastructure architecture disciplines\nUnderstanding of architecture and design across all systems\nWorking proficiency in developmental toolsets\nAbility to collaborate with high-performing teams and individuals throughout the firm to accomplish common goals\nProficiency in one or more general purpose programming languages\nUnderstanding of software skills such as business analysis, development, maintenance and software improvement\nCorporate Technology\n\nThe Corporate Technology (CT) organization develops applications and provides technology support for corporate functions across JPMorgan Chase, including Global Finance, Corporate Treasury, Risk Management, Human Resources, Compliance, Legal, and all functions within the Corporate Administrative Office (CAO).\n\nCT teams are aligned with corporate partners' evolving technology needs and the firm's ever expanding technology controls agenda.\n\nA top CT priority is purpose-building scalable corporate systems. Teams focus is on:\nResponding to the evolving regulatory environment and helping to meet the firm's regulatory commitments by addressing internal and external commitments\nAdvancing the firm's Roadmap programs -- Single Sourcing of data, Architecture Convergence, and Rationalization of Application Portfolio and Platforms\nAdopting industry leading technologies to support best-in-class business capabilities for high performance computing and data storage solutions\nDriving innovation across the firm's corporate technology portfolio, increasing efficiencies through process automation and Agile application development, with an emphasis on user experience and shorter development cycles\nInvesting in security & controls for cyber, access/entitlements uplift, data protection and application resiliency\nControls & Operational Risk Technology supports - identification, assessment, and prioritization of risks followed by coordinated application of resources to minimize, monitor, and control the probability and/or impact of events.\n\nTech at JPMC:\n\nWhen you work at JPMorgan Chase & Co., you're not just working at a global financial institution. You're an integral part of one of the world's biggest tech companies. In 14 technology hubs worldwide, our team of 40,000+ technologists design, build and deploy everything from enterprise technology initiatives to big data and mobile solutions, as well as innovations in electronic payments, cybersecurity, machine learning, and cloud development. Our $9.5B+ annual investment in technology enables us to hire people to create innovative solutions that will not only transform the financial services industry, but also change the world.\n\nKey Responsibilities\nDesign and Development of key functionality within the application\nCarry out design reviews/code reviews at agreed points throughout the project life cycle\nWork closely with the vendor development team to monitor the design/development undertaken by them\nHands on design and development of technical artifacts\nParticipate in technical reviews; define/Improve processes on configuration management, deployment and resiliency planning for the application.\nQualifications - Internal:\n\nCompetencies:\n\nEssential:\nHTML5, CSS 3.0, Bootstrap, Angular 8.x+, JavaScript, JQuery and comparable languages\nProficient with Angular framework and hands on Angular 8+ version.\nProficient with Unit testing with Jasmine or protractor.\nKnowledge and of using and building Restful services\nProficient with Java and hands on Java 8+ version.\nExposure to micro-services pattern is must\nTesting tools - Jasmine/ Karma/ protractor\nVersion Control - GIT\nStrong understanding of design principles and design patterns is a must.\nShould be able to set standards, define templates etc. to promote reusability and establish standards.\nAbility to mentor team and collaborate with distributed teams is a must.\nMust have an eye for pixel perfection, attention to detail along with strong hands on experience.\nInteract with UX designers, product owners and produce quick prototypes to seek feedback.\nMust be able to work in fast paced environment and be able to adapt to changing requirements.\nAgile experience is a must.\nConduct testing of completed applications, websites and software to Assess user experience\nAutomated, Manual, Progression/Regression and Exploratory testing experience and deployment validation support.\nTest Management, Defect Management and reporting/tracking expertise. Jenkins, Ci/CD, Selenium.\nEssential Experience:\n5 - 8 years' work experience\nExposure to technology development projects and the full technology development lifecycle\nExcellent Communication and Inter-personal skills, both with business customers and with fellow IT professionals (Business Analysts, Project Managers and Developers).\nStrong problem-solving skills\nA delivery focused approach to work and the ability to work without direction\nAbility to multi-task\nAbility to work to deadlines\nAbility to work effectively in a collaborative environment to create top-performing interfaces\nClosing Statement\n\nAt JPMorgan Chase & Co. we value the unique skills of every employee, and we're building a technology organization that thrives on diversity. We encourage professional growth and career development, and offer competitive benefits and compensation. If you're looking to build your career as part of a global technology team tackling big challenges that impact the lives of people and companies all around the world, we want to meet you.JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management.\n\nWe recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs.",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000014",
    "text": "Software Engineer\n\nJOB DESCRIPTION\n\nJob Title: Software Engineer I\n\nSUMMARY\n\nThe Software Engineer I is responsible to design, code, and/or configure solutions for moderate complexity Agile stories, as well as writing automated unit and integration-level tests.\n\nESSENTIAL JOB FUNCTIONS/RESPONSIBILITIES\nDesigns, codes, and/or configures solutions for moderate complexity Agile stories with some guidance from more a senior software engineer.\nDebugs and resolves moderate complexity software bugs or issues, working independently, and finds the real root cause and provides a fix without collateral damage.\nWrites automated unit and integration-level tests under own direction.\nMay create or support the creation of a conceptual design/architecture for small scale software solutions with guidance from an architect or more senior developer.\nMay provide guidance and mentoring to more junior software engineers.\nFollows development standards and effectively demonstrates technical solutions to other software engineers in code reviews.\nAssists in making source code management decisions for one or more teams.\nPerforms source code management tasks without specific guidance required from other team members.\nPerforms other related duties and activities as required.\nExperience developing in cloud environments like Azure, Google, AWS a plus.\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice.\n\nQUALIFICATIONS/REQUIREMENTS\n\nEducation and Work Experience:\nBachelor’s degree or higher education level, or its foreign equivalent, in Computer Science, Computer Information Sciences, and/or related field\nTotal Work Experience: 6+ years (software development), 4 years minimum,\nProduct Experience: 2 years minimum, 4+ years preferred\nDomain Experience: 2 years minimum, 4+ years preferred\nSpecialized Knowledge, Skills, and/or Abilities:\nExpert in Object-oriented design, Java or .NET development, Relational OLTP queries and Relational database design\nCapable of XML/XSLT document design, JavaScript development, HTML5 & CSS\nAbility to manage to deadlines, communicate in a team, and operate independently with guidance\nUnderstands how to estimate, analyze, and the Software Product Development Lifecycle with Agile methodology\nOther Requirements:\nWork Authorization: Legally authorized to work in the country of the job location.\nPhysical: Exerting up to 10 pounds of force occasionally and/or negligible amount of force frequently or constantly to lift, carry, push, pull or otherwise move objects, including the human body. Sedentary work involves sitting most of the time. Jobs are sedentary if walking and standing are required only occasionally and all other sedentary criteria are met",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000015",
    "text": "Java Developer\n\nOverview:\n\nWestern National is seeking a highly collaborative and influential front-end developer to join our team in developing exceptional experiences. This exceptional opportunity offers someone a chance to contribute to a highly impactful organizational initiative that will transform how our customers interact with our company.\n\nThe ideal candidate has 5+ years of Software Development experience with strong experience in modern Javascript (ES6+) and Node. The candidate would ideally have experience with Vue or similar web frameworks, and there is a high preference for Java experience. Come join our team for opportunities to grow your skills and be a part of something truly transformative.\n\nResponsibilities:\nWork in an agile environment with other IT teams.\nCollaborate with business partners to implement new features.\nMentor Jr level team members.\nEstimate effort and assist in prioritization of business feature requests.\nIdentify and resolve software application issues.\nPrepare technical design specifications, flow charts, and data flow diagrams.\nDevelop and execute unit tests.\nImplement software solutions based on business requirements.\nIdentify and implement process enhancements and automation.\nRegular interaction with business partners across organization.\nOccasional interaction with external vendors.\nQualifications:\n5+ years of software development experience.\nProficient in modern Javascript (ES6+) and Node.\nStrong experience with HTML5 / CSS3 / SCSS.\nModerate to strong experience with Vue or similar web frameworks (React, Angular).\nModerate to strong experience developing or consuming REST web services.\nModerate to strong experience developing with Java is helpful.\nExperience with Javascript testing frameworks (Jest, Mocha, etc.).\nExperience with build tools such as npm and webpack.\nExperience with version control (SVN or Git).\nExperience with Dev Ops and/or continuous integration (CI) tools (Jenkins) is useful.\nExperience in an agile environment.\nStrong verbal and written communication skills.\nStrong analytical and problem-solving skills.\nB.S. Degree in Computer Science or equivalent experience.\n\nWestern National Insurance is a growing, A+ rated (A.M. Best) group of property-and-casualty insurance companies serving individuals, families, and businesses in 20 states across the Midwestern and Western U.S. plus Alaska. Currently ranked as the 57th largest private company by revenue in Minnesota (Minneapolis-St. Paul Business Journal), Western National has consistently earned accolades as an employer of choice, including as a Star Tribune Top Workplace (2011 – 2016), and previously as a recipient of the Minnesota Business Ethics Award, as a Minnesota Business Magazine Top 100 Workplace, as a Principal Financial “10 Best” Company, and as a finalist for the Alfred P. Sloan “When Work Works” Award.\n\nWestern National is known as “The Relationship Company®”, and caring for employees is a key part of that relationship commitment. Western National offers competitive pay, advancement opportunities, a generous benefits package, a robust wellbeing program, and a healthy work/life balance (including three weeks of paid time off, nine paid holidays, and eight hours of paid volunteer time as a starting point for new employees). These attributes are just some of the reasons why nearly half of our employees choose to stay on the Western National team for 10 years or more.\n\nOur benefits package includes:\n\n401(k) company match\nMedical insurance – We offer affordable (thanks to a strong employer subsidy), above-average coverage and the choice of either a traditional Preferred Provider Organization (PPO) option OR a High-Deductible Health Plan (HDHP) option\nWestern Wellbeing program – Including on-site massage, yoga classes, salad and healthy snack days, sit/stand workstations, nutrition seminars, and more\n100% company-paid tuition reimbursement for approved, job-relevant coursework\nDiscounts on automobile and homeowner's insurance\nOther standard employee benefits – Including dental insurance, vision benefits, life insurance, disability insurance, and more\n\nWe could continue to list the things that we think make Western National a great place to work, but why not hear it instead from actual current and former employees? Here are some quotes that Western National employees have posted to the Glassdoor public review site:\n\n“Excellent company which prioritizes customer service and community service.”\n“Just a great place to come to work, and stay for a career. I love the personal touch from [the] executive suite on down. [The] CEO is on a first-name basis with everyone.”\n“Above-average benefits, especially on the health insurance front.”\n“I have felt welcomed here and I feel like the Senior Management cares.”\n\n(For more reviews from current and former Western National employees, you can visit the company’s Glassdoor page here: http://bit.ly/2qXtl4A .)\n**Western National is an equal opportunity employer. All qualified applicants will receive consideration for employment.***",
    "title": "Java Developer",
    "required_skills": []
  },
  {
    "id": "jd_000016",
    "text": "Wordpress Developer\n\nExperience: 2-5 years\n\nJob Location:- Aurangabad/Pune\n\nVacancies:- 02\n\nNote: Fresher Do Not Apply\n\nJob Description\n\nLooking for experienced developers who are passionate to work with an IT / Software Development company.\n\nBasic Requirements:\nHaving prior working experience on WordPress\nShould be proficient verbally and written communication skills.\nShould be capable of writing an efficient code using best software development with good coding practices.\nAble to integrate data from various back-end services and databases.\nAble to integrate with external application ERP/CRM\nShould be capable of working on Payment gateway integration on multiple platforms\nShould have adequate knowledge of relational database systems and Object Oriented Programming.\nHands on experience required upon web applications including Security and session management.\nCapable of self- upgrading upon emerging new technologies and apply them into operations and activities.\nAble to deliver projects before deadlines.\nAble to work on multiple Frameworks such as Zend etc. would be an added advantage\nResponsibilities and Duties\nShould be able to manage on handling Multiple Projects\nManage project independently\nManage clients\nAble to handle the team\nDeliver projects before deadlines.\nRequired Experience, Skills and Qualifications\n\n• WordPress\n• Plugin-in development\n• PHP\n• HTML/HTML5\n• Javascript/jQuery\n• Bootstrap\n• MySQL\n\nQualification:\n• UG: B.Sc (CS/CSC/IT), BCA, BCS, BE, B.Tech (CS/CSE/IT)\n• M.Sc (CS/CSC/IT), MCA, MCS, ME, M.Tech (CS/CSE/IT)",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000017",
    "text": "iOS Developer\n\nJob Code : ID190704\n\nJob Description:\nExperience: 1 to 2 years in iOS Development\nNative iOS development\nHybrid app development with PhoneGap, Ionic, Titanium will be an advantage\nDatabase knowledge is must\nUnderstanding about Requirement Gathering - Client interactions\nGood communication skills\nQualification: BE( Computers/ Information Technology), MCA, BCA, BSc (Computer Science)\nLocation: Margao Goa",
    "title": "iOS Developer",
    "required_skills": []
  },
  {
    "id": "jd_000018",
    "text": "Database Administrator\n\njob description summary highly skilled technical role ultimate responsibility support hpe oracle database environment providing technical expertise designing building tuning installing configuring troubleshooting database middleware technology provide technical leadership large complex database build migration effort work closely engineer architect project program manager define design strategy better data management infrastructure process role responsible developing documenting maintaining logical physical database model ; ensuring design comply standard guideline procedure ; research analyze impact proposed change ensure corporate data effectively implemented managed secured provide consulting support application development team well dba 's complex integrated system including distributed solution provide analysis guidance migration consolidation effort job description position provide support architecture planning installation monitoring configuration administration testing evaluating troubleshooting oracle database instance collaborate application infrastructure team adherence best practice process standardization key responsibility position monitor ensure high availability environment quickly respond diagnose problem utilize leverage new feature underlying technology work closely enterprise database manager.. another area responsibility position provide leadership role create awareness guidance application development business team migrate consolidate re-platform various application oracle no-sql technology work minimal supervision receives general direction enterprise database manager responsibility design backup/recovery procedure ensure validity develop archival strategy conforms hpe security audit guideline develop execute appropriate delivery team model e.g resource skill process management meet current projected needs/constraints support implementation new release dbms software ; plan implement new feature appropriate mentor le experienced dba 's application developer ensure adequate 24x7 support develop “ ” procedure deal incident perform database migration merging consolidation needed participate change incident management procedure problem resolution analyze database implementation method ensure line company policy proactively monitor operation log optimize system performance using available monitoring db optimization tool additional job description experience oracle data guard standby/failover administration highly skilled oracle 10g/11g/12c database administration hand experience query tuning performance optimization db ops automation alert monitoring backup restore hand experience data modeling design knowledgeable oracle rac & asm administration knowledgeable pl/sql procedure package development experience managing high performing team database ability prioritize workload work effectively pressure high degree independence must versatile flexible proactive resolving technical issue ability handle diverse situation rapidly changing priority deadline experience setting database disaster recovery site plus excellent interpersonal communication skill exposure sql server no-sql database technology plus education professional experience bachelor ’ degree computer science information technology related field least 10+ year hand work lead support production database previous leadership team management experience strong organizational time management skill communicate/work effectively team environment effective meeting deadline li-mf1 hewlett packard enterprise eeo f/m/protected veteran/ individual disability hpe comply applicable law related use arrest conviction record including san francisco fair chance ordinance similar law consider employment qualified applicant criminal history",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000019",
    "text": "DevOps Engineer\n\nJob Summary\n\nOur mission at Style Theory is to build a sustainable model for fashion consumption. We rely on the latest and best technology to build apps and services to ensure the women of Style Theory an intimate relationship with their “infinite wardrobe”. We are also constantly improving the experience both on the apps and the services through a series of iterations because we constantly listen to the feedback from the women of Style Theory, as well as ideas that we brainstormed to help achieve our mission above. With your help, we can achieve it even faster!\n\nWe are looking for an experienced Senior DevOps Engineer to continue to design and hands-on implement our cloud-based micro-service infrastructure. Ideally, they would have experience in\nsupporting the large scale and highly critical applications. Your tasks will be designing, developing, and improving our next-generation infrastructure. Migrating applications to the new infrastructure with proper architecture design and working closely with the Dev and QA teams, resolve and automate production issues, while also providing rostered on-call support.\n\nResponsibilities\nDeploying, automating, maintaining, and managing cloud-based production system to\nensure the availability, performance, scalability, and security of production systems.\n(AWS & GCP)\nBuild, release, and configuration management of production systems\nSystem troubleshooting and problem-solving across platform and application domains.\nSuggesting architecture improvements, recommending process improvements.\nHands on for critical parts of development, testing, deployment, and production\nautomation and tools to ensure everything is built according to the best practices\nCarry out your on-call duties as part of a critical team handling our cloud\ninfrastructure performance and availability\nMentor other engineers, define our technical culture and help build a fast-growing\nteam.\nRequirements\nAt least 3 years of experience in a similar role.\nDesign, operation, and maintenance of robust, large-scale distributed systems\nExperience in Linux Environment.\nGood understanding and practical experience with configuration management (e.g.\nAnsible, Chef, and Puppet) and Infrastructure as Code such as Terraform.\nExperience with automation from simple shell/python scripting to more complex\nsoftware engineering solutions.\nStrong background in either AWS or GCP is a must.\nProblem-solving ability to analyze and resolve complex infrastructure issues by using\nMonitoring tools (Datadog, Prometheus, Grafana).\nKubernetes experience is a must!. (EKS, GKE, Openshift)\nStrong experience using CI/CD tools such as Jenkins, GitLab CI, etc., or Java based\nintegration tools such as Groovy. It would be great to know how to implement Jenkins\nconfiguration, CI pipelines via code, etc.\nExperience in on or more of Bash, Go, Python, JS.\nHighly accountable and takes ownership. Outstanding work ethic, high-integrity, team\nplayer, and a lifelong learner\n\nNice to have\nExperienced with Data Engineering services like Lake Formation, Glue, Athena, Redshift,\nSagemaker, Kineses, Kafka, BigQuery etc.\nExperienced with SQL and NoSQL Databases like DynamoDB, RDS, PostgreSQL,\nElasticSearch, MongoDB, etc.",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000020",
    "text": "Database Administrator\n\ncountry place mortgage founded 1995 subsidiary cavco industry inc. national lender providing wide variety financing option purchaser manufactured home cavco industry inc. wa founded 1965 fast growing publicly traded company disrupting manufactured home industry headquartered phoenix arizona cavco leading designer builder manufactured home modular home commercial building park model rv ’ vacation cabin company ’ insurance group standard casualty offer wide range insurance product manufactured home owner country place mortgage seller servicer mortgage fannie mae freddie mac fha authorized lender ginnie mae mortgage-backed security issuer employee biggest asset play integral role meeting need customer come part team offering many opportunity utilize talent atmosphere support encourages realize full potential come share helping people realize dream opportunity home ! come share story part building something amazing ! country place mortgage currently looking database administrator work office located addison tx responsible designing building administering maintaining oracle database must able perform daily administration database system prevent outage plan optimized system resource utilization position contribute architectural direction provide expertise design performance database structure assist database performance tuning database capacity issue replication distributed data issue strong understanding sql standard diagnostics performance tuning must responsibility build support oracle database linux based system perform evaluation modification integration function associated vendor supplied database software ensure business continuity developing implementing highly available database system database recovery plan procedure serve resource le experienced team member escalated issue routine nature support oracle database weblogic qualification bachelor ’ degree comparable industry experience 2+ year oracle database experience experience database support iaa paas preferred in-depth understanding database tool utility well highly developed sql database performance tuning skill knowledge computer hardware san/nas networking verbal written communication skill problem solving skill customer service interpersonal skill ability work independently manage one time loan origination/servicing support experience helpful mandatory _cavco industry committed providing equal employment opportunity without regard race color religion sex sexual orientation gender identity national origin age disability protected status respect recruitment hiring promotion term condition employment disclaimer statement intended describe general nature level work performed associate assigned classification construed exhaustive list responsibility duty skill required personnel classified personnel may required perform duty outside normal responsibility time time needed._",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000021",
    "text": "Wordpress Developer\n\nPosition: WordPress Developer\nLocation: Prahladnagar, Ahmedabad\nExperience: 4 to 8 Years\nWorking Timings: 10:00 AM to 7:00 PM\n\nWorking Days: Alt Sat Off\n\nWordPress Developer Responsibilities:\n\n· Meeting with clients to discuss website design and function.\n\n· Designing and building the website front-end.\n\n· Creating the website architecture.\n\n· Designing and managing the website back-end including database and server integration.\n\n· Generating WordPress themes and plugins.\n\n· Conducting website performance tests.\n\n· Troubleshooting content issues.\n\n· Conducting WordPress training with the client.\n\n· Monitoring the performance of the live website.\n\n·\n\nWordPress Developer Requirements:\n\n· Bachelor’s degree in Computer Science or a similar field.\n\n· Proven work experience as a WordPress Developer.\n\n· Knowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQuery.\n\n· Knowledge of code versioning tools including Git, Mercurial, and SVN.\n\n· Experience working with debugging tools such as Chrome Inspector and Firebug.\n\n· Good understanding of website architecture and aesthetics.\n\n· Ability to project manage.\n\n· Good communication skills.\n\nJob Type: Full-time\n\nSalary: ₹25,000.00 - ₹70,000.00 per month\n\nSchedule:\nDay shift\nExperience:\nWordPress: 1 year (Preferred)\nwork: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nNo",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000022",
    "text": "JavaScript Developer\n\nMonetizeMore builds industry leading ad technology that is seen by more than 300M people per month. The company has been running for 8 years achieving consistent double digit growth each year with a team of 100+ team members spread across the globe.\n\nMonetizeMore offers location and schedule freedom to every one of its team members. That means that you would have the lifestyle autonomy to choose to work from anywhere in the world, during the time of day you prefer. This new-age work lifestyle would enable you to engineer your ideal lifestyle. Say goodbye to endless commutes, stuffy business attire and the arbitrary 9 – 5 work day. Take your life back into your hands by joining the MonetizeMore team!\n\nThe product team is the fastest and most innovative team in the company. Build greenfield technology that is disrupting the ad technology industry. Solve problems that have never been solved before. Join a company culture that replaces constant meetings and interruptions with innovation that continues to break boundaries. Take your skillset to the next level with some of the best minds in the ad technology industry to make a real difference with MonetizeMore.\n\nResponsibilities\nThe day-to-day work of a MonetizeMore web developer includes:\n\nDeveloping features or product using: JavaScript, Python/Flask, PostgreSQL, Linux, Docker, Git, Cloud Services and any other new technologies.\nBuilding JavaScript applications capable of tracking and responding to billions of requests per month.\nDeveloping APIs and integrating with 3rd party APIs to automate manual tasks.\nImplementing UI facilitating third-party reporting and streamlining ad operations.\nIntegration of services to maximize ad revenues and maintain strong user experience.\nPlanning and prototyping new applications.\nDefect resolution of existing and new issues.\nUnit testing new features to ensure they conform to MonetizeMore’s quality standards and meet requirements.\nCode reviews.\nRunning performance benchmarking tests.\nStaying up to date with new trends and advancements in web development and ad tech.\nAttending daily stand-up meetings (15 mins) and other Scrum meetings (Every 3 weeks).\n\nAttributes\nMonetizeMore web developer attributes include:\n\nTeamwork Attributes:\n\nCollaboration: Working remotely on complex projects necessitates that you work together with your team and share knowledge.\nCommunication Skills: You are comfortable communicating in English at all levels, have strong spoken and written communication skills and are an active listener.\nTeamwork: You value team synergy and are excited about helping your team succeed.\nInterpersonal Skills: You are able to get along, work well and coordinate with others.\nConflict Management: As a team, we are proactive in dealing with conflict. You are able to find constructive ways of resolving issues with other team members.\n\nTechnical Attributes:\n\nTechnology: A MonetizeMore developer is proficient in all stages of web development, from conception to deployment. You are a one-person army, ready and willing to attack any technical challenge that crosses your path\nAnalytical and Problem Solving Skills: You work hard to understand technical issues and to resolve them in an effective manner.\nDetail Orientation: You work on many parts of an application or system at the same time and are able to focus on each detail meticulously.\nInitiative: You work well in a team, with little supervision, making well-reasoned and effective technical decisions.\nReliability and Responsibility: You demonstrate reliability at all times. You give reasonable expectations within Agile Scrum framework and work hard and smart to achieve and surpass those expectations. You communicate what you are going to do, then meet that commitment.\nThought Leadership: You analyze MonetizeMore’s tech stack, systems and processes with the goal to iterate on a regular basis. You look for opportunities to improve to increase value to MonetizeMore and suggest them to the team.\n\nIf you think you are a good fit to join the MonetizeMore product team, please apply below and give specific reasons what sets you apart. We hire individuals not robots so don’t be afraid to show a little personality ;)\n\nPowered by JazzHR\n\nxC69vHwaZD",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000023",
    "text": "Database Administrator\n\nqualification essential qualification related ba/bs two year work experience area database design administration unrelated ba/bs four year work experience area database design administration experience troubleshooting resolving desktop server network issue experience providing technical support microsoft dynamic application support preferred qualification excellent verbal written communication skill attention detail effective problem-solving organizational decision-making ability demonstrated ability meet deadline prioritize task manage project work independently experience knowledge microsoft window operating system microsoft office platform server administration sql server microsoft dynamic 365 great plain certification peoplesoft experience job hiring salary range $ 59000- $ 72000 depending qualification position located within classroom technical service ct - unit within office classroom management ocm - support unique need educational research environment offering design installation maintenance service classroom technology duty position include leading supporting server software administration telecommunication equipment associated network device department ’ technical engineering service administrative iso university staff position monitor system server process resource help troubleshoot problem arise additionally position recommend solutions/changes system settings/business process identify work-arounds implemented permanent fix made purpose work performed identification design assessment installation maintenance related av telecommunication hardware software related network peripheral device resource support iso design installation delivery service av/it good service u-wide classroom boardroom meeting room teaching learning conferencing technology system administration 50 responsible technical administrational operation & maintenance ct server system responsible server network administration oit department manager responsible establishing policy procedure necessary meet department client need provide support special application requiring extensive knowledge & expertise university-wide iso service work internal & external vendor developing solution unique software issue update upgrade server latest service pack security update add/remove/adjust user access ct server system keeping accurate record user assist rapid thorough resolution production issue evaluate document report issue management vendor evaluate issue pattern plan execute process improvement system upgrade ensure documentation business requirement create detailed functional/technical specification maintain in-depth knowledge business process one multiple business area work internal external contract support resource regarding system administration duty function ct application expert maintenance enhancement 25 define configuration step standard setup troubleshoot problem recommend configuration process improvement resolve complex hardware/software compatibility concern develop installation script test program meet system requirement perform routine duty maintaining network/domain via wbob hosted virtual server farm efficiency security data file data correctness back-up application usability licensing server uptime performance provide network hardware software support microsoft dynamic 365 & gp microsoft pdk sql report efs software perceptive content software software support av engineering window 10 office peoplesoft financial software process maintain related documentation library procedure disaster recovery planning procedure research recommend test hardware service package ocm-cts assist maintaining network configuration file manage administer telecommunication plan account iso staff participate it-related project it-related procurement assist developing resolution solution technical issue user support 20 develop deliver training program end user lead development new support procedure standard increase effectiveness efficiency provide support complex computing environment area hardware software network check report user ’ desktop laptop workstation performance provide technical support user required desktop mobile device printer peripheral maintain extensive library user training aid material needed assist creating report query requested user 5 perform duty assigned including deptartmental project related primary job function assist development process improvement attaining departmental goal related improving efficiency cost effectiveness customer service asr position offer following benefit university paid contribution 10 salary retirement account - vested immediately 22 paid vacation day per year addition paid medical leave 11 paid holiday reduced tuition opportunity covering 75 - 100 eligible tuition excellent affordable health care benefit wellness program opportunity earn lower health care rate free disability insurance free basic life insurance benefit 115 base salary $ 200000 maximum department mission academic support resource asr make positive difference student ’ life asr committed cultivating sustaining environment diverse equitable inclusive better able serve represent university community ensuring value difference individuality knowledge skill ability asr employee include job knowledge communication problem solving/analysis development leadership teamwork customer service office classroom management ocm directly support high quality teaching learning faculty student university classroom ocm central point contact single point responsibility accountability general purpose classroom study space issue ocm national leader coordination operation classroom focused continual improvement teaching learning environment apply application must submitted online considered position please click apply button follow instruction completing online application please upload following document ensure full consideration cover letter express interest qualification position updated resume name contact information three professional reference willing speak freely qualification character additional document may attached application accessing `` activity '' page uploading document request accommodation application process please e-mail employ @ umn.edu call 612 624-uohr 8647 diversity university recognizes value importance diversity inclusion enriching employment experience employee supporting academic mission university committed attracting retaining employee varying identity background university minnesota provides equal access opportunity program facility employment without regard race color creed religion national origin gender age marital status disability public assistance status veteran status sexual orientation gender identity gender expression learn diversity u http //diversity.umn.edu background check information offer employment contingent upon successful completion background check presumption prospective employee eligible work criminal conviction automatically disqualify finalist employment u university minnesota twin city umtc university minnesota twin city umtc among largest public research university country offering undergraduate graduate professional student multitude opportunity study research located heart one nation 's vibrant diverse metropolitan community student campus minneapolis st. paul benefit extensive partnership world-renowned health center international corporation government agency art nonprofit public service organization",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000024",
    "text": "PHP Developer\n\nJob Summary\n**\nWe are looking for Fresher PHP developers who possess a passion for pushing web technology to the limits and will work with our team of talented engineers to design and build the next generation of existing services\nThe candidate should have basic knowledge of PHP, HTML5, CSS3, Jquery, with good knowledge of communication skills.\nResponsibilities and Duties\nCandidate must have IT Background and should be familiar with technologies.\nMust have good interpersonal skills.\nMust have Innovative, knowledgeable, creative, and hard-working\nKey Skills\nPHP, WordPress, HTML, CSS\nRequired Experience and Qualifications\nExp. : 0 - 3 Year\nQua. : B.E./B.TECH./M.E./M.TECH./MCA\nContract length: 1 month\nJob Types: Full-time, Internship, Fresher\nSalary: ₹12,000.00 - ₹34,000.00 per month\nBenefits:\nFlexible schedule\nSchedule:\nDay shift\nExperience:\nsoftware development: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nLicence:\nCore PHP (Preferred)\nProgramming Languages needed:\nPython (Preferred)\nIndustry:\nSoftware Development",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000025",
    "text": "iOS Developer\n\nJob Responsibilities:\nDesign and build applications for the iOS platform.\nHelp maintain code quality, organization, and automatisation.\nEnsure the performance, quality, and responsiveness of applications.\nIdentify and correct bottlenecks and fix bugs.\nCollaborate with a team to define, design, and ship new features.\nProficient with Objective-C or Swift (depending on project requirements).\nExperience with iOS frameworks such as Core Data, Core Animation, etc.\nStrong knowledge of SDLC methodologies - ideally Agile.\nExperience with offline storage, threading, and performance tuning.\nFamiliarity with RESTful APIs to connect iOS applications to back-end services.\nFamiliarity with push notifications.\nProficient understanding of code versioning tools (such as Git, Mercurial or SVN).\nUnderstanding of Apples design principles and interface guidelines.\nExperience with performance and memory tuning with tools (such as Instruments, depending on project needs).\nFresher with good technical knowledge or have training in iPhone are also welcome to apply for the Job.",
    "title": "iOS Developer",
    "required_skills": []
  },
  {
    "id": "jd_000026",
    "text": "Java Developer\n\nSoftware Developer\n\nWho we are:\nThe American Physical Society (APS) is a nonprofit membership organization working to advance and diffuse the knowledge of physics through its outstanding research journals, scientific meetings, and education, outreach, advocacy, and international activities. APS represents over 55,000 members, including physicists in academia, national laboratories, and industry in the United States and throughout the world. Society offices are located in College Park, MD (Headquarters), Ridge, NY, and Washington, D.C.\n\nSoftware Developer\nWho we are:\n\nThe American Physical Society (APS) is a nonprofit membership organization working to advance and diffuse the knowledge of physics through its outstanding research journals, scientific meetings, and education, outreach, advocacy, and international activities. APS represents over 55,000 members, including physicists in academia, national laboratories, and industry in the United States and throughout the world. Society offices are located in College Park, MD (Headquarters), Ridge, NY, and Washington, D.C.\n\nPosition Summary:\n\nThe American Physical Society, a leading publisher of scientific journals, based in Suffolk County, LI, is seeking a front end developer. This is an exciting opportunity to apply your strong front end development and UX skills to build applications used in all aspects of scientific publishing. We’re a group who happily share knowledge and value other ideas, while working in a bright, modern office with a friendly atmosphere and flat hierarchies. We will challenge you with interesting work while providing you with a collaborative culture in a fast paced environment. Our staff is encouraged to attend industry conferences and we are constantly playing with new tools and use all the latest and greatest technologies, affording you the capability to impact all aspects of your projects. You must have excellent English communication skills, be a problem solver and a team player, and be results oriented. Other incentives for working at APS are great pay, great benefits, generous 403(b), fun company events, commuter benefits, and 3 weeks paid vacation.\n\nPlease provide code samples and URL's of previous applications you've developed. Candidates who provide links to their GitHub profiles or personal websites with technical articles and/or code samples will receive priority.\n\nIs This You:\n\nRequired Skills\nExpert knowledge of HTML5, CSS3, and associated web standards\nExperience writing modern Javascript (ES6/ES2015, ES2017, Typescript, etc).\nExperience with front-end frameworks such as React or Vue.js\nExperience with modern front-end tooling (Babel, webpack, gulp, parcel, etc.)\nProficiency in building responsive web applications\nKnowledge of UI/UX design concepts, pattern libraries, style guides, etc.\nBasic command line proficiency (Linux and/or Mac OS X preferred)\nExperience with Git or a similar version control system\nExperience with AWS or similar cloud service providers\nDesired Skills\nExperience doing test driven development with Jest, Jasmine, Mocha/Chai/Sinon, Karma. Integration testing with Selenium.\nExperience with server side development (node.js, express, etc.)\nBasic knowledge of GraphQL\nExperience with additional programming languages (clojurescript, Typescript preferred)\nAccessibility\nOur Mission:\n\nTo advance and diffuse the knowledge of physics for the benefit of humanity, promote physics, and serve the broader physics community, we:\nProvide a welcoming and supportive professional home for an active, engaged, and diverse membership\nAdvance scientific discovery and research dissemination\nAdvocate for physics and physicists, and amplify the voice for science\nShare the excitement of physics and communicate the essential role physics plays in the modern world\nPromote effective physics education for all\nThe core values that drive our mission are:\nThe Scientific Method\nTruth and Integrity\nDiversity, Inclusion, and Respect\nPartnering, Cooperation, and Open Collaboration\nSpeaking Out\nEducation and Learning\nThe American Physical Society is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, ethnic or national origin, ancestry, pregnancy (including childbirth or related condition), citizenship, familial status, mental or physical disability, veteran status, genetic information, other non-disqualifying disability, or any other characteristic protected by law.\n\nWe welcome you to apply today!",
    "title": "Java Developer",
    "required_skills": []
  },
  {
    "id": "jd_000027",
    "text": "Django Developer\n\nFull Job Description\n\nCoordinating with development teams to determine application requirements.\n\nWriting scale able code using Python programming language.\n\nTesting and debugging applications.\n\nDeveloping back-end components.\n\nIntegrating user-facing elements using server-side logic.\n\nAssessing and prioritizing client feature requests.\n\nIntegrating data storage solutions.\n\nCoordinating with front-end developers.\n\nReprogramming existing databases to improve functionality.\n\nDeveloping digital\n\ntools to monitor online traffic.\n\nSHARE YOUR RESUME HR TEAM WHAT’S APP NUMBER 76-175-733-20",
    "title": "Django Developer",
    "required_skills": []
  },
  {
    "id": "jd_000028",
    "text": "DevOps Engineer\n\nVidooly is looking for candidates with analytical minds and result oriented work ethics to join our software engineering dev ops team in a full-time role. A positive, eager, and responsive attitude to solve problems is the most important requirement for the role.\nWe are a SaaS-based video intelligence software product company, based in Noida Sector 62. Our customers are online video content creators, media companies, brands, multi-channel networks & agencies across the world.\nnoofpost\n1\nedu\nlanguage\nexperience\n3-6 years\nroles\nroleheading\nrolepoint\nAs an engineer, the incumbent would be responsible to automate and streamline our operations and processes.\nBuild and maintain tools for deployment, monitoring and operations.\nTroubleshoot and resolve issues in test and production environments.\nResearch and recommend innovative, and where possible, automated processes for Systems Administrator tasks.\nMaintain integrity of the network, server deployment and network security.\nAdminister servers, storage devices, backup devices, VPN Gateways, and wireless infrastructure.\nPerform daily system and security monitoring.\nHandle critical operation tasks as well as on demand requests.\nWork closely with development teams to integrate their projects into the production AWS environment and ensure their ongoing support once there.\nBe a DevOps champion - work closely with other internal teams to build security, reliability, and scalability into the development lifecycle.\nBuild engineering automation and productivity tools to streamline and scale applications in the production environment.\nBuild from the ground up reliable infrastructure services in AWS to deliver highly scalable services.\nExperience in failover configuration and Disaster Recovery process setup.\nTroubleshoot and resolve issues related to application development, deployment, and operations.\nskills\nGood hold in LINUX Operating System\nMonitoring - CloudWatch, Nagios, New Relic, ELK\nSolid experience and background working with AWS services including but not limited to EC2, VPC, ELB, S3, CloudFormation, Opsworks, RDS, Route53, SQS, IAM, SES, API Gateway, EMR, Auto scale, Cloud watch, etc.\nStrong written and verbal communication skills, along with customer service, troubleshooting, and skills.\nB.E/B-Tech/BCA/MCA/M-tech with 3-6 year of experience in software product company managing server.",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000029",
    "text": "JavaScript Developer\n\nNo relocation needed, can telework from home, required good Internet*\nWho is TEKgile?*\nWe are a tech company that works with our international partners to deliver modern apps and software for various types of businesses. We work with global companies and various clients to always push the limits of web and server applications.\nWhy would I want to be a JavaScript Developer at TEKgile?*\nTEKgile and our International partner company aims to continue its growth trajectory in Japan and have a variety of geospatial web app projects to work on. Software and app improvements are vital to the success of the company and are looking to grow our team to add new features to what is being offered. You will be working with our Product Manager, who is based in Japan as well as our Technical manager in Trivandrum. The team focuses on all product life cycle, bugs, and features that relate to the existing clients and future needs of the project.\n\nThe JavaScript Developer role is focused on building various web app dashboards focused around geospatial data, and continuing to grow the functionality and capabilities of our frameworks. Responsibilities include helping to grow the features of existing projects and new projects. You would be partnered with other team members to assist with various DevOps tasks.\nWe are looking for someone that is: *\nLooking to take ownership of your tasks and be held accountable for their quality and completion\nInterested in modern applications\nCode ninja with an attention to detail\nBeing great at what you do and enjoy doing it\nWhat would I be doing?*\nSupport the development of server and web applications that are based on JavaScript (ExtJS 6, NodeJS).\nFocused on supporting the continued development and improvements to the existing and new JavaScript applications for frontend and backend.\nImplementing features independently or with team members\nWriting unit tests, internal and external documentation.\nDebugging, and problem-solving bugs.\nWorking with SQL based databases\nWorking in the AWS Cloud environment.\nWhat key skills and experience do I need?*\nProficiency in English\nStrong understanding of and experience in JavaScript (MVC & MVVM)\nStrong understanding of NodeJS, Express and ES6\nExperience in web app JavaScript (Bootstrap, jQuery)\nExperience in both functional and object-oriented programming\nGood understanding of SQL\nExperience in writing Unit Tests\nIt would be great if you can also bring: *\nExperience in PostgreSQL and PostGIS\nExperience in ExtJS 6.x\nExperience in HTML/CSS\nGood understanding of NoSQL (MongoDB/ElasticSearch)\nExperience in Amazon AWS Lambda, API Gateway, EC2, S3, SNS, SQS\nUnderstanding and experience in OAuth v2\nWhat are the perks?*\nMonday to Friday schedule (5 day weeks / 40 hour work weeks)\nUp to 5% performance bonus (paid quarterly)\nCompetitive salary\nPersonal laptop stipend\nAbility to work from home anywhere in India\nCompany Values*\nQuality service* - We make sure all of our customers that use our product have the best experience.\nAbility to adapt *- Being in a startup lifestyle and new technology space, we look for team members that are always willing to adapt to the constant change.\nPushing the limits *- We feel that there is always room to improve and be the best in our space. Everyone's input is valued and encouraged to make everything better.\nHelp the team *- \"How can I help?\" is a common phrase where we work. It is not only about completing your goals and tasks but important that we pitch in to help make sure the team hits their goals as well.\nJob Type: Full-time\n\nBenefits:\nPaid sick time\nPaid time off\nWork from home\nSchedule:\nDay shift\nMonday to Friday\nExperience:\ntotal work: 4 years (Required)\nJavaScript: 3 years (Preferred)\nEducation:\nBachelor's (Required)\nBenefits:\nPaid leaves / Leave encashment\nWork from home\nFlexible work hours\nIndustry:\nSoftware Development\nWork Remotely:\nYes",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000030",
    "text": "Machine Learning\n\nVista Equity Partners is the world's leading private equity firm for Enterprise Software and recently invested $1.5B in the Reliance Jio Digital Platform. As part of the Vista portfolio, Integral Ad Science (IAS) is a NYC-headquartered global technology and data company that builds verification, optimization, and analytics solutions for the advertising industry. We are looking for a Senior Manager, Data Engineering to join our new and fast-growing Engineering team in Pune. If you are excited by technology that has the power to handle hundreds of thousands of transactions per second; collect tens of billions of events each day; and evaluate thousands of data-points in real-time all while responding in just a few milliseconds, then IAS is the place for you!\n\nAs a Senior Manager, Data Engineering, Brand Safety you will drive the transformation of the Brand Safety Pipeline. You will manage processes that crawl tens of millions of pages per day and that score those pages in real-time using machine learning algorithms. The ideal candidate is naturally curious, dedicated, detail-oriented with a strong desire to work with awesome people in a highly collaborative environment. You should be able to not take yourself too seriously as well.\n\nWhat you'll do:\nPlan and deliver data engineering projects\nCollaborate with various IAS teams throughout the full software development lifecycle including CI/CD, Product, Architecture\nManage performance of the team including recurring 1:1s, performance reviews, goal setting and professional development\nIdentify roadblocks and remove them proactively\nImplement effective metrics and monitoring processes\nDriving a culture of continuous improvement\nStay informed about new technologies and trends in data engineering\nWho you are and what you have:\nMinimum 2 years of relevant technical lead experience\n5+ years of relevant experience in at least one object oriented language (Java, Python or Scala preferred)\n5+ years of relevant experience in SQL and comfortable working with large datasets to identify insights\nGood knowledge of Data Science, Machine Learning\nExperience with open source big data technologies (MapReduce, Spark, Flink)\nExperience designing, developing and deploying data pipelines in the Cloud\nStrong problem solving skills\nExperience managing and mentoring a team of data engineers\nWhat puts you over the top (one of the following):\nExpertise implementing streaming data pipelines using open source technologies\nExperience with AWS or GCP ecosystem\nExperience in productionalizing machine learning models\nAbout Integral Ad Science\n\nIntegral Ad Science (IAS) is the global market leader in digital ad verification, offering technologies that drive high-quality advertising media. IAS equips advertisers and publishers with both the insight and technology to protect their advertising investments from fraud and unsafe environments as well as to capture consumer attention, and drive business outcomes. Founded in 2009, IAS is headquartered in New York with global operations in 18 offices across 13 countries. IAS is part of the Vista Equity Partners portfolio of software companies. For more on how IAS is powering great impressions for top publishers and advertisers around the world, visit integralads.com.\n\nEqual Opportunity Employer:\n\nIAS is an equal opportunity employer, committed to our diversity and inclusiveness. We will consider all qualified applicants without regard to race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability or age. We strongly encourage women, people of color, members of the LGBTQIA community, people with disabilities and veterans to apply.\n\nCalifornia Applicant Pre-Collection Notice:\n\nWe collect personal information (PI) from you in connection with your application for employment or engagement with IAS, including the following categories of PI: identifiers, personal records, commercial information, professional or employment or engagement information, non-public education records, and inferences drawn from your PI. We collect your PI for our purposes, including performing services and operations related to your potential employment or engagement. For additional details or if you have questions, contact us at compliance@integralads.com.\n\nTo learn more about us, please visit http://integralads.com/ and https://muse.cm/2t8eGlN\n\nAttention agency/3rd party recruiters: IAS does not accept any unsolicited resumes or candidate profiles. If you are interested in becoming an IAS recruiting partner, please send an email introducing your company to recruitingagencies@integralads.com. We will get back to you if there's interest in a partnership.",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000031",
    "text": "PHP Developer\n\nJob Description:\n\n1-4 years of experience as a PHP Developer with proven track.\n\nRequirements:\n\nIntegration of user-facing elements developed by front-end developers\nBuild efficient, testable, and reusable PHP modules\nUnderstanding the fully synchronous behavior of PHP\nBasic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3.\nFamiliarity with limitations of PHP as a platform and its workarounds.\n\nSoftware Skills:\n\nfront-end technologies, such as JavaScript, HTML5, and CSS3",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000032",
    "text": "PHP Developer\n\n1 - 3 years experience\nFront-end skills: HTML, CSS, JS, Jquery, Ajax, Bootstrap\nBackend: Mysql, PhpMyadmin\nFrame-works: Laravel, Codeignitor, Zend\nUnderstanding of MVC design patterns\nKnowledge of object oriented PHP programming\nJob Type: Full-time\nSalary: Up to ₹400,000.00 per year\nSchedule:\nMonday to Friday\nExperience:\nsoftware development: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nLicence:\nCore PHP (Preferred)\nProgramming Languages needed:\nPython (Preferred)",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000033",
    "text": "Machine Learning\n\nStaff Machine Learning Scientist\n\nHyderabad/Bangalore (Remote)\n\nCompass is building the first modern end-to-end real estate platform by integrating agents, buyers and sellers through technology. Before Compass, no one has achieved the blend of the Natural Intelligence that hundreds of thousands of enterprising real estate agents bring to this market, with the Artificial Intelligence that cloud, mobile and AI technologies enable.\n\nAs one of the fastest growing technology companies of our generation, in an industry larger than any other, we have an opportunity and obligation to build a world-class engineering team and the operating platform that will transform the real estate industry. In 2019 we tripled the size of our Product & Engineering team, and are searching for creative and inspiring colleagues at all levels of the engineering organization to join us as we continue to expand in 2020.\n\nWe are looking for Staff Machine Learning Scientists with a proven track record of solving machine learning problems through utilizing strong machine learning and data science skills. This is an opportunity to make a huge impact in a fast-paced environment at a great company.\n\nAbout the role\n\nCompass is looking for a Staff Machine Learning Scientist to help us build the future of real estate. Compass is building an end-to-end real estate technology platform that empowers agents and consumers. The AI team is responsible for using machine learning to build features which empower our agents through intelligent tools, and add intelligence to our consumer facing products. We are looking for someone with a proven track record of deploying and supporting machine learning models at scale in customer facing features.\n\nResponsibilities:\n\nUsing your machine learning skills to explore and deeply understand Compass's data.\nArchitect the machine learning products to solve business needs\nPerform feature engineering and modeling tasks on top of this data to power customer facing features.\nCollaborate with machine learning engineers to produce features in a production ready state.\nSupport machine learning features throughout the product life cycle.\nDrive design and implementation of our in-house machine learning infrastructure.\n\nWhat we look for:\n\nExperience working on machine learning in a product oriented environment.\nAbility to collaborate with scientists, product management and work with an engineering-focused, iterative team to build and establish product requirements.\nKnowledge of machine learning frameworks and tooling, for example Spark, PyTorch, SciKit learn, etc.\nComfortable building prototypes from scratch\nExperience working with a microservices based architecture.\nExperience with AWS development.\nPhD or MS in Computer Science/Machine Learning or equivalent (PhD is preferred) and 8+ years experience is preferred.\n\nAt Compass, our mission is to help everyone find their place in the world. This means we continually celebrate the diverse community different individuals cultivate. As an equal opportunity employer, we stay true to our mission by ensuring that our place can be anyone's place. Check out our Engineering blog!",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000034",
    "text": "Backend Developer\n\nSummary of the Position:\n\nWe are seeking a Backend Developer to join our application development team at India (Pune) Development Center. The candidate will play a significant role in developing highly interactive and cutting-edge applications for enterprise clients. The candidate will provide hands-on development expertise and technical abilities to deliver quality software solutions.\n\nJob Responsibilities:\n\nDevelop Microservices and REST API that will integrate with Frontend.\nTranslate business requirements into high-quality code.\nExperience in deploying application on Cloud- Azure.\nFocus on code maintainability and performance of an application.\nProvide technical advice and assists in solving programming problems\nHands-on experience with unit and automation testing tools such as Junit\n\nMinimum Qualifications:\n\nBachelor’s degree in any Engineering discipline from reputed engineering college\n6+ years of strong programming skills in Cloud Technologies and backend development\nHands-on experience in deploying Microservices and REST APIs using Java and Spring Boot.\nStrong integration experience using Node.js, AJAX and JSON\nExperience in working with NoSQL like Combos DB and RDBMS like Azure, SQL.\nStrong deployment experience on Azure functions.\nNice to have:\nHands-on experience with Build and CI/CD tools like Ant, Gradle, Docker, Jenkins\nHands-on experience with unit and automation testing tools such as Junit, Rest Assured, Serenity, JMeter, etc\nWorking knowledge of software design patterns, distributed systems, resiliency, security and logging\nPassionate, adaptable, flexible, independent and self-motivated individuals who take initiative and ownership of projects are desired.\nNice to have good written and verbal communication skills\n\nCompany Description\n\nInfogain is a Silicon Valley headquartered company with software platform engineering and deep domain expertise in the travel, retail, insurance and high technology industries. We accelerate the delivery of digital customer engagement systems using digital technologies such as cloud, microservices, robotic process automation and artificial intelligence to our clients.\n\nInfogain delivers positive business outcomes for Fortune 500 companies and digital natives, using rapid prototyping and a solid foundation of DevSecOps-based software platform engineering that ensure high-quality and on-time delivery. A ChrysCapital portfolio company, Infogain has offices in California, Washington, Texas, London, Dubai, India and Singapore, with delivery centers in Austin, New Delhi, Bangalore, Pune, and Mumbai.\n\nVisit us as www.infogain.com to learn more.",
    "title": "Backend Developer",
    "required_skills": []
  },
  {
    "id": "jd_000035",
    "text": "DevOps Engineer\n\nMandatory skills: Kubernetes and docker\nExperience with DevOps CI/CD applications and automated build and deploy configuration and processes.\nHands on skills in public cloud.Hands on skills in Jenkins, GIT, Sonarqube, Artifactory, JIRA.\nMust have worked on Ansible.Experience with Maven, npm and other build frameworks.\nAble to deploy micro services and provide DevOps driven solutions in a multi-tenant cloud based architecture.\nExperience with webservers like nginx, tomcat and JBoss.\nShould have troubleshooting knowledge in database and networking.Experience in Shell, Python scripting & Linux knowledge.\nStrong knowledge in Docker.Able to create custom Dockerfile and Docker-compose files.\nExperience in container orchestration tools like kubernetes, OpenShift and etc.\nExperience with monitoring tools like zabbix, nagios,AppDynamics.\nExperience with ELK Stack / Splunk.\nWorked in Agile development methodologies.\nExperience in Production environments and SRE activities\n\nJob Types: Full-time, Volunteer\n\nExperience:\ntotal work: 3 years (Required)\nDevOps: 3 years (Preferred)\nWork Remotely:\nYes",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000036",
    "text": "Network Administrator\n\nBE / BCA / any bachelor degree\nCertification: -\nCCNP, CCNA\nExperience\n1 + years of overall experience as a Network/ Security Engineer either in Service Provider Environment or diverse enterprise network.\nKey Responsibilities\nManagement and configuration of Checkpoint/ Fortigate firewall & IPS Technology Checkpoint / Switching / Routing.\nConfiguration of Cisco Routers\nExpert to handle the day to day checkpoint/ Fortigate firewall & IPS operational issues.\nInitial firewall/ IPS testing of parameters, operation, support and commissioning.\nKnowledge of Analysis of IPSec VPNs implementation and Manage and Monitor all VPN connectivity.\nExperience in network monitoring in NOC/ SOC to identify security breaches, service outages, network performance issues.\nKnowledge of Analyse, troubleshoot, and investigate security- related, information systems anomalies based on security platform reporting, network traffic, log files, host- based and automated security alerts\nTroubleshooting and root cause analysis of related issues firewall/ IPS Work efficiently with customer support team to solve customer issues.\nAnalysing, troubleshooting and correcting network problems remotely and on- site.\nMaintaining and administering perimeter security systems such as firewalls and intrusion detection systems\nGood Communication and can handle incident and problem management.\nProblem solving skills on checkpoint firewalls, switching and routing devices.\nGood knowledge in MPLS and internet leas line links.\nAdhere to change control process.\nHas the ability to work on his/ her own, be able to remain calm under pressure and to keep his managers informed of progress against a programme of work.\nJob Type: Full-time\nSalary: ₹20,000.00 - ₹30,000.00 per month\nSchedule:\nDay shift\nExperience:\nwork: 1 year (Required)\ntotal work: 1 year (Required)\nNetwork Administration: 1 year (Required)\nEducation:\nBachelor's (Required)",
    "title": "Network Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000037",
    "text": "Wordpress Developer\n\nWe are on the hunt for a Wordpress developer with 2-4 years of experience who is capable of collaborating with our web designers to match visual designs.\nSkills and Qualifications\nPrior experience in working with WordPress, Plugin Customization, WordPress + Woo-Commerce, Magento (or Any other PHP open source Framework)\nMust have expertise in WordPress theme integration and should be able to work as per client instruction to design page layouts.\nKnowledge of other PHP CMS like Magento, Joomla, and CakePHP would be an added advantage.\nGood understanding of cross-platform and cross-browser issues, and web performance optimization.\nBasic knowledge of the Search Engine Optimization process.\nExperience with Reactjs is a plus.\nRoles and Responsibilities\nWrite testable, well designed, and efficient code by using best software development practices and reusable PHP modules to match the latest international web protocols, standards and technologies.\nCreate website layouts /user interface by following standard HTML/CSS and WordPress practices.\nIntegrate data from various back-end services and databases.\nBe responsible for maintaining, expanding, and scaling various websites.\nStay plugged into emerging technologies and industry trends.",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000038",
    "text": "Network Administrator\n\nJob Duties:\nHardware and Software installation and troubleshooting management.\nDay to day troubleshooting WI-FI access points.\nStrong knowledge of Network and Server maintenance.\nHands on experience of handling windows based servers.\nAble to use variety of IT Software and resolve Hardware issues.\nThe candidate should be able to perform the work in relation to Network Administrator and Security, configure and maintain all network switches, routers and firewalls.\nWhat We’re Looking For:\nA person that aspires to be a leader and has a proactive “can do” attitude and has a proven track record driving successful projects.\nProblem Solving, Strategic Planning, Multi-tasking\nEnergetic, self-motivated, with a strong propensity to succeed.\nHighly organized, with an ability to prioritize time-sensitive assignments.\nJob Types: Full-time, Contract\nSalary: ₹10,000.00 - ₹15,000.00 per month\nExperience:\nwork: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nNetwork Administration: 1 year (Preferred)\nEducation:\nSecondary(10th Pass) (Preferred)",
    "title": "Network Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000039",
    "text": "PHP Developer\n\nJob Description\n\nWe are looking for a PHP Developer responsible for managing back-end services and the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.\n\nResponsibilities\nCommunicating with external web services\nIntegration of user-facing elements developed by front-end developers\nBuild efficient, testable, and reusable PHP modules\nSolve complex performance problems and architectural challenges\nIntegration of data storage solutions\nDevelopment of software as per norms fixed\nPerform review, repair or expansion of software program to improve efficiency and handle new requirements\nPreparation of documentation as desired\nTimely completion of software\nTarget for no errors in testing phase\nTarget for no errors in post implementation phase\nWrite “clean”, well-designed code\nProduce detailed specifications\nTroubleshoot, test and maintain the core product software and databases to ensure strong optimization and functionality\nContribute in all phases of the development lifecycle\nFollow industry best practices\nDevelop and deploy new features to facilitate related procedures and tools if necessary\nKeep abreast of the latest technologies in related fields\nSkills\nStrong knowledge of PHP web frameworks such as CodeIgnitor\nUnderstanding the fully synchronous behaviour of PHP\nUnderstanding of MVC design patterns\nBasic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3\nKnowledge of object oriented PHP programming\nUnderstanding accessibility and security compliance\nStrong knowledge of the common PHP or web server exploits and their solutions\nUnderstanding fundamental design principles behind a scalable application\nUser authentication and authorization between multiple systems, servers, and environments\nIntegration of multiple data sources and databases into one system\nFamiliarity with limitations of PHP as a platform and its workarounds\nCreating database schemas that represent and support business processes\nFamiliarity with SQL/NoSQL/MySQL databases and their declarative query languages\nProficient understanding of code versioning tools, such as Git\nBonus Points for Experience with:\nAWS (hybrid cloud solutions, EC2, simple queuing service)\nRedis or Memcached\nLocation based services\nDevOps or QA\nRESTful APIs\nApply\n×\nSubmit Your Application\n\nAll fields marked with an asterisk (*) are required.\n\nFull Name*\nPhone*\nEmail*\nCurrent Company\nDescription\nUpload CV*\nSubmit\nClose",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000040",
    "text": "Software Engineer\n\nNokia is a global leader in the technologies that connect people and things. With state-of-the-art software, hardware and services for any type of network, Nokia is uniquely positioned to help communication service providers, governments, and large enterprises deliver on the promise of 5G, the Cloud and the Internet of Things.\n\nServing customers in over 100 countries, our research scientists and engineers continue to invent and accelerate new technologies that will increasingly transform the way people and things communicate and connect.\n\nNokia is an equal opportunity employer that is commited to diversity and inclusion.\n\nAt Nokia, employment decisions are made regardless of race, color, national or ethnic origin, religion, gender, sexual orientation, gender identity or expression, age, marital status, disability, protected veteran status or other characteristics protected by law.\n\nYears of experience:\n\n6-9 years\n\nEducation:\n\nBE/BTech/MTech/MCA in Computer Science/Electronics/Electrical/Information Science/Telecom\n\nGrade/Level: JG 8 ( 6 to 9 years of experience )\n\nSkills Required:\nStrong experience in designing and developing applications using Java SE and EE.\nStrong experience in Multithreading.\nStrong experience in testing frameworks: Junit, Jmockit, Easy Mock\nStrong experience in Spring Framework\nExperience in WEB standards and technologies: REST, SOAP, XML\n\n6. Good understanding in security aspects like TLS, TCP, knowledge of linux permissions, certificates, security algorithms.\n\n7. R&D Experience in Agile (Kanban is a plus)\nGood to have:\nTest Automation(ROBOT tool, Selenium).\nScripting experience with Shell/Perl/Python\nKnowledge of LDAP (X.500) and Tools like Wireshark, etc are added advantage\nTelecom domain know how.\nCloud Principles\n\n6. Experience in containerization ( knowhow in Dockers & Kubernetes )\n\nSoft Skills:\nSelf-starter able to make progress with minimal supervision\nGood Communication Skills and Presentation Skills\nStrong collaborative & leadership skills\nYears of experience:\n\n3-6 years\n\nEducation:\n\nBE/BTech/MTech/MCA in Computer Science/Electronics/Electrical/Information Science/Telecom\n\nGrade/Level: JG 7 ( 3 to 6 years of experience )\n\nApply now.",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000041",
    "text": "Software Engineer\n\nIf you are a current Motorola Solutions employee, please click this link to apply through your Workday account.\n\nCompany Overview\n\nAt Motorola Solutions, we create technologies our customers refer to as their lifeline. Our technology platforms in communications, software, video and services help our customers work safely and more efficiently. Whether it’s helping firefighters see through smoke, enabling police officers to see around street corners, or reliably keeping the lights on in homes and businesses around the world, our work supports those who put their lives on the line to keep us safe. Bring your passion, potential and talents to Motorola Solutions, and help us usher in a new era in public safety and security.\n\nDepartment Overview\nUGWP\n\nJob Description\nAnalyzes, develops, designs, and maintains software for the organization’s products and systems. Performs system integration of software and hardware to maintain throughput and program consistency. Develops, validates, and tests: structures and user documentation.\n\nBasic Requirements\nHands-on experience in a full-stack python application development.\nExperience in creating REST API using Flask/Django Framework.\nFamiliarity with concepts of MVC, ORM, and Restful\nGood understanding of databases (Postgresql) or NoSQL(CBS)\nHands-on experience with front-end technologies like Angular\nStrong knowledge of OOPs concepts.\nFamiliar with Agile development methodologies and test-driven development\nSelf-motivated, results-driven individual, must be passionate about the work\n\nTravel Requirements\n\nRelocation Provided\n\nPosition Type\n\nReferral Payment Plan\nNo",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000042",
    "text": "Java Developer\n\nWe are seeking talented and creative individuals for a Java Developer opportunity on our Performance Management team to develop and evolve our enterprise software applications. You will have passion and enjoy solving complex issues, learning new technologies and designing/delivering user-friendly solutions. In addition, you should be self-motivated and committed, and able to work independently or in cooperation with other team members from different disciplines.\n\nResponsibilities\nAnalyze, design, program, debug, and modify software enhancements, and/or new products.\nWrite scalable, reliable, & maintainable code and perform testing and debugging of applications.\nComplete documentation and procedures for installation and maintenance.\nPerform product design, implementation, bug verification, release testing, and beta support that may require research and analysis.\nEngage in daily or weekly interaction with users or cross-functional team members to define system requirements and/or necessary modifications.\nWork closely with Solution Architects and Project Managers to propose technically feasible solutions and set accurate expectations on effort and timeline.\nCooperate efficiently with the delivery teams of Design and Quality Assurance to ensure that each area is delivering quality, on time.\nRequired Skills\n2 to 5+ years' experience in a software development role\nBachelor's Degree in Computer Science or related technical discipline\nGood level of written and oral English is essential\nAdvanced experience of Java in a professional environment\nExperience working on a shipped product\nGood knowledge of Spring, Hibernate, JSF, J2EE, SQL and Oracle\nProfessional experience of web applications development\nKnowledge of coding techniques & technology frameworks\nAn understanding of installations, testing methodologies, and troubleshooting techniques\nPassion to solve an unmet need\nDesired Skills\nPrevious experience with commercial HRIS applications\nKnowledge of Agile methodologies\nExperience with Adobe Flex\nProfessional experience in a SAAS model\nExperience in SDLC\nUnderstand enterprise market\n\nApply now at careers@providenceconsulting.in",
    "title": "Java Developer",
    "required_skills": []
  },
  {
    "id": "jd_000043",
    "text": "Wordpress Developer\n\nGreetings of the day!!!!\n\nPosition- WordPress Developer/ SEO Executive\n\nLocation- Bhubaneswar\n\nType- Fulltime/ Day Shift\n\nSalary- Negotiable\nSkillset for WordPress Developer-*\n*Strong proficiency in WordPress, Woocomerce*\n*Strong knowledge in UI, JavaScript, jQuery, Ajax, HTML, CSS, Bootstrap*\nSkillset for SEO Executive-*\n*Handling Search Engine Optimization activities for our internal company websites *\n* *Planning and implementing SEO strategies *\n*Perform On-page and off-page activities to boost page rankings *\n*Handling and managing social media accounts to brand our company and services *\n*Updating the website or making any changes to the HTML layout *\n*Uploading samples, new content on website etc. as and when needed *\n*Working with Google Analytics, Stat counter and webmaster tools *\n*Keyword analysis *\n*Handle Google updates effectively to manage the ranking *\nJob Type: Full-time\nSchedule:\nDay shift\nExperience:\n4: 1 year (Preferred)\nWork Remotely:\nNo",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000044",
    "text": "Node js developer\n\nJob Description\n3+ years’ experience working on Node/Express and Angular Node JS, Angular Js HTML5, CSS, Node JS, JQuery and JavaScript stacks, MongoDB, Familiarity with event-driven, asynchronous I/O frameworks\nExpertise in any Relational or NoSQL databases\nExperience in developing RESTful/GraphQL APIs and microservices based applications\nComfortable with software development best practices: unit tests, code reviews, continuous integration, deployment, secure and clean code.\nExperience is Linux development environment\nHands on development experience within microservice based architecture\nKnowledge of server/client interactions (e.g. scalability, caching, Web application performance optimization, etc\nProficient understanding of cross-browser compatibility issues and ways to work around them",
    "title": "Node js developer",
    "required_skills": []
  },
  {
    "id": "jd_000045",
    "text": "Flutter Developer\n\nWe are looking for Experienced & well knowledge in React Native & Flutter candidate. Please don't apply fresher & Basic Knowledge & Skill Developer.*\nResponsibilities : -*\nBuild pixel-perfect, smooth UIs across both mobile platforms.\nDevelop new components and features for mobile app(s).\nDiagnose and fix bugs and performance bottlenecks for performance that feels native.\nRequirements : -*\nExperience working with a JavaScript framework, preferably React/React Native/Flutter.\nFirm grasp of the synchronous and asynchronous JavaScript and its nuances, including ES6+ syntax.\nUnderstanding of Flexbox based mobile UI design Knowledge in React Native/Flutter and approach towards component based structuring.\nUnderstanding of REST APIs & 3rd Party APIs, the document request model, and offline storage.\nFamiliarity with native build tools, like XCode, Gradle and state management libraries of React, like Redux, is an added advantage.\nGood sense of design, animations and micro-interactions is a plus.\nKindly revert with your updated CV and acknowledge me the same.\nNote : - Please don't Apply job if you can't travel till Bhayander. We don't want any Central & Harbour Line candidate. So please don't waste your time as well as our time. APPPLY IF YOU TRAVEL TILL BHAYANDER.*\nContract length: 3 - 6 months\n\nApplication Deadline: 10/10/2020\n\nExpected Start Date: 12/10/2020\n\nJob Types: Full-time, Temporary, Walk-In\n\nSalary: ₹10,000.00 - ₹20,000.00 per month\n\nExperience:\nFlutter: 1 year (Preferred)\nReact Native: 1 year (Required)\nReact JS: 1 year (Required)\nTotal Work: 1 year (Required)\nAPIs Development: 1 year (Required)\nApplication Question:\nWhere are you located ?(Mention Station Name)\nProgramming Languages needed:\nHTML (Required)\nCSS (Required)\nJavaScript (Required)\nJava (Required)\nPHP (Required)\nWork Remotely:\nNo",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000046",
    "text": "Machine Learning\n\nCompany Description:\nHireXP is committed to building collaborative teams of technically creative and talented individuals, and the company welcomes applications of interest from global talent.\nWe are trusted by the world's most innovative organizations. Our vision is to become the most trusted company to provide HR Automation Solutions in the world, through an unrelenting commitment to product quality and service excellence.\nAt HireXP, technology is at the heart of everything we do. We are doubling down on our -Technology First- approach that puts technology at the core of our growth strategy.\n\nExplore the future with us:\nDo what you love and map your own future: we support your passion and empower the individual capabilities\nBe who you are and impact the world: we embrace and celebrate diversity and ideas\nPerks and benefits:\nFlexi working hours\nOpportunity to learn the Startup Growth Strategy.\nJob Description:\n\nWe are looking for a Machine Learning (ML) Engineer to help us create products using AI.\n\nResponsibilities\nDesign models and pipeline for pre - processing of data and automatic classification based on Machine Learning /Artificial Intelligence models\nIdentify, analyse and interpret trends and patterns in complex data to provide answers to Operational/service questions\nPresent data and analysis in a clear and concise manner to allowing audience to quickly understand results and recommendations to make data-driven decisions\nStudy and transform data science prototypes\nResearch and implement appropriate ML algorithms and tools\nDevelop machine learning applications according to requirements\nSelect appropriate datasets and data representation methods\nRun machine learning tests and experiments\nPerform statistical analysis and fine-tuning using test results\nExtend existing ML libraries and frameworks\nRequirements\nProven experience as a Machine Learning Engineer or similar role\nUnderstanding of data structures, data modelling and software architecture\nDeep knowledge of math, probability, statistics and algorithms\nAbility to write robust code in Python\nFamiliarity with machine learning frameworks (like Keras or PyTorch) and libraries (like scikit-learn)\nOutstanding analytical and problem-solving skills\nExperience in cloud services e.g. PaaS and SaaS, Rest API, serverless functions",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000047",
    "text": "DevOps Engineer\n\nRequirements\n\nStrong background in Linux/Unix Administration and Linux Shell scripting\nGood experience with any or more of mentioned cloud infra providers : AWS, IBM, Azure and GCP.\nKnowledge of relational and NoSQL databases, aware of Active-Active and Active-Passive database replica setup. NoSQL sharded database setup.\nHands-on experience on working with CI/CD tools like jenkins.\nHand-On Experience of working with Monitoring tools like Icinga.\nAbility to communicate well in a team\nExperience with centralized logging and monitoring\nExperience with Agile methodology\nHands-on experience of working with containers and container orchestration Dockers and Docker Swarm or kubernetes.\nHands-on experience of working on Puppet or Chef or Ansible.\nGood communicator / team worker.\n\nKey Skills\nAWS, CI/CD, TFS, Jenkins, MongoDB,Cassandra,NoSQL, MSSQL, Linux, Azure, VMware, GIT, Containers, SQL, GIT, Ansible, Icinga or Nagios, Scripting, splunk,loggly\nAdd On Skills\noneOps, openStack\nExperience: 1-3years\nLocation: Noida/Hyderabad",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000048",
    "text": "iOS Developer\n\nWe are looking for an iOS developer who possesses a passion for pushing mobile technologies to the limits and will work with our team of talented engineers to design and build the next generation of our mobile applications.\nResponsibilities\nDesign and build advanced applications for the iOS platform\nCollaborate with cross-functional teams to define, design, and ship new features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\nRequirements\nProven working experience in software development\nWorking experience in iOS development\nHave published one or more iOS apps in the app store\nA deep familiarity with Objective-C and Cocoa Touch\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies\nSolid understanding of the full mobile development life cycle\nJob Types: Full-time, Walk-In\nSalary: ₹50,000.00 - ₹70,000.00 per month\nSchedule:\nFlexible shift\nWork Remotely:\nTemporarily due to COVID-19",
    "title": "iOS Developer",
    "required_skills": []
  },
  {
    "id": "jd_000049",
    "text": "Software Engineer\n\nRole Proficiency:Level of Proficiency:Independently develops error free code with high quality validation of applications, guides other developers and assists Lead 1 – Software EngineeringOutcomes:1. Understand and provide input to the application/feature/component designs; developing the same in accordance with user stories/requirements. 2. Code, debug, test, document and communicate product/component/features at development stages. 3. Select appropriate technical options for development such as reusing, improving or reconfiguration of existing components. 4. Optimise efficiency, cost and quality by identifying opportunities for automation/process improvements and agile delivery models 5. Mentor Developer 1 – Software Engineering and Developer 2 – Software Engineering to effectively perform in their roles 6. Identify the problem patterns and improve the technical design of the application/system 7. Proactively identify issues/defects/flaws in module/requirement implementation 8. Assists Lead 1 – Software Engineering on Technical design. Review activities and begin demonstrating Lead 1 capabilities in making technical decisionsMeasures of Outcomes:Measures:1. Adherence to engineering process and standards (coding standards) 2. Adherence to schedule / timelines 3. Adhere to SLAs where applicable 4. Number of defects post delivery 5. Number of non-compliance issues 6. Reduction of reoccurrence of known defects 7. Quick turnaround of production bugs 8. Meet the defined productivity standards for project 9. Number of reusable components created 10. Completion of applicable technical/domain certifications 11. Completion of all mandatory training requirementsOutputs Expected:Code:Develop code independently for the aboveConfigure:Implement and monitor configuration processTest:Create and review unit test cases, scenarios and executionDomain relevance:Develop features and components with good understanding of the business problem being addressed for the clientManage Project:Manage module level activitiesManage Defects:Perform defect RCA and mitigationEstimate:Estimate time, effort, resource dependence for one's own work and others' work, including modulesDocument:Create documentation for own work as well as perform peer review of documentation of others' workManage knowledge:Consume and contribute to project related documents, share point, libraries and client universitiesStatus Reporting:Report status of tasks assigned Comply with project related reporting standards/processRelease:Execute release processDesign:LLD for multiple componentsMentoring:Mentor juniors on the team Set FAST goals and provide feedback to FAST goals of menteesSkill Examples:1. Explain and communicate the design / development to the customer 2. Perform and evaluate test results against product specifications 3. Develop user interfaces, business software components and embedded software components 5 Manage and guarantee high levels of cohesion and quality 6 Use data models 7. Estimate effort, and resources required for developing / debugging features / components 8. Perform and evaluate test in the customer or target environment 9. Team Player 10. Good written and verbal communication abilities 11. Proactively ask for help and offer helpKnowledge Examples: 1. Appropriate software programs / modules 2. Technical designing 3. Programming languages 4. DBMS 5. Operating Systems and software platforms 6. Integrated development environment (IDE) 7. Agile methods 8. Knowledge of customer domain and sub domain where problem is solved",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000050",
    "text": "Flutter Developer\n\n*Candidates having project closure experience will be preferred\n*Strong in OOPS, functional Programming\n*Exp with offline storage, threading, low battery usage and performance tuning\n\n*Strong communication skills\n\n1.00-3.00 Years\n\nBachelor Of Computer Application (B.C.A), Master in Computer Application (M.C.A)",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000051",
    "text": "DevOps Engineer\n\nJob Description :\nHitachi Vantara combines technology, intellectual property and industry knowledge to deliver data-managing solutions that help enterprises improve their customers' experiences, develop new revenue streams, and lower the costs of business. Hitachi Vantara elevates your innovation advantage by combining IT, operational technology (OT) and domain expertise. Come join our team and our employee-focused culture, and help drive our customers' data to meaningful customer outcomes.\n\nResponsibilities:\nâ€¢ Setup, monitor and maintain DevOps cloud-based SAAS products and solutions involving IoT, big data, microservices, Cloud, containers and machine learning\nâ€¢ Maintain security and data privacy, ensure compliance and perform required security, compliance and performance tests\nâ€¢ Work with architects on deployment architecture, security and CI/CD and then implement these on the cloud\n\nQualifications:\nâ€¢ 2 to 5 years' experience in a DevOps role in projects involving Java, NodeJS, J2EE, messaging, Microservices and Containers for complex, scalable, SAAS or enterprise grade products\nâ€¢ Experience in Big data technologies such as Spark, Cassandra, HDFS, Kafka, Druid, Hive, HBase, ELK stack in a complex Big Data product/project\nâ€¢ Experience with agile and Scrum\nâ€¢ Experience in implementing CI/CD using Jenkins/Bamboo and Chef/Ansible/Puppet/Terraform\nâ€¢ Infrastructure and APM monitoring using tools such as Zabbix, Nagios, Splunk, PagerDuty, Glowroot, AppDynamics etc.\nâ€¢ Experience with Docker and container orchestration using Kubernetes, Mesos or DC/OS\nâ€¢ Experience with AWS (preferable) or other popular CSP\nâ€¢ Experience with Big data operations and tuning\nâ€¢ Ability to work with distributed teams in a collaborative and productive manner\nâ€¢ Strong problem solving, analytical, design, architecture, decision-making and communication skills.\nâ€¢ Self-driven and motivated with the desire to work in a fast-paced, results-driven agile environment with varied responsibilities.\n00-5.00 Years",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000052",
    "text": "Java Developer\n\nJava Developer*\nSummary Description: *\n_*Temporarily work from home due to COVID-19. Once restrictions lifted, NOT 100% remote.*_ Requires at least 3 days a week on Site in Alexandria, VA and up to 2 days remote.\n\nLTG Federal is seeking a software engineer in support of a concentrated effort at a large Federal Agency to bring legacy, high priority IT systems up to current and supported operating levels while also addressing critical needs for high availability, fail-over capability, decoupling of highly connected systems, and/or cloud-based solution implementations.\nJob Specifications: *\n· Designs, develops, documents, tests and debugs application software.\n\n· Conducts analysis and collaborates with subject matter experts in the planning, design, development, and utilization of electronic data processing systems for information storage, processing, presentation, manipulation, display, or reporting.\n\n· Provides software development support to translate the enterprise's strategy for legacy system upgrade/migration to the desired future state including support of both the development and execution of a transition plan\n\n· Interacts at a variety of points within the customer organization and program governance processes to assist in implementation of the established transition plan\n\n· Supports research and advises on the analysis of alternatives in the determination of upgrade, refactor, or other solution recommendations.\n\n· Ensures a focus on incorporation of high availability, fail-over capability, decoupling of highly connected systems, and/or cloud-based solution implementations\n\n· Conducts test driven development in the delivery of high quality code.\n\n· Coordinates and collaborates with subject matter experts and other architect leads to ensure consistent application of customer mission objectives are met\n\n· Leveraging domain expertise, develops comprehensive understanding of customer requirements and leads the development of a complete solution meeting all technical and functional requirements.\nRequired: *\n· Working knowledge of object-oriented design and development skills.\n\n· Experience in developing quality software products and shipping production ready software.\n\n· Experience in building applications in Java using Spring Framework and Spring Boot.\n\n· Good understanding of agile methodologies.\n\n· Experience in building web applications using technologies like React JS or Angular JS.\n\n· Experience in Oracle, PL/SQL and other RDBMS.\n\n· Minimum 5-6 years of work experience with BA/BS degree or 4 years of work experience with Master’s degree.\nDesired: *\n· Experience with Database Consolidation and/or Separation, Data Migration from one Storage Platform to another\n\n· Experience with Cloud Migration, Implementation, AWS Services, FedRAMP, System Integration capability\n\n· Experience with Application Lifecycle Management (ALM), Rational ClearQuest/ClearCase, Rally, Subversion, Nexus, Jenkins, Sonar, Crystal Reports\n\n· Experience with automation technologies like Puppet, Chef, Ansible, Selenium, Jenkins, Nexus, and Docker.\n\n· Good understanding of Web Services protocols such as REST, SOAP and API design for extensibility and portability.\n\n· Experience working with CI/CD tools for testing and deployment.\n\n· AWS certifications or Java certifications is a plus.\n\nLocation: Alexandria, VA and possible remote\n\nClearance: Able to obtain Public Trust. Having a current Public Trust or higher clearance a Plus\n\nJob Type: Full-time\n\nPay: $85,000.00 - $100,000.00 per year\n\nExperience:\nAngular: 3 years (Preferred)\nDatabases: 5 years (Preferred)\nJava: 6 years (Preferred)\nWork Location:\nOne location\nBenefits:\nHealth insurance\nDental insurance\nVision insurance\nRetirement plan\nPaid time off\nTuition reimbursement\nSchedule:\nMonday to Friday\nCompany's website:\nwww.ltgfederal.com\nBenefit Conditions:\nOnly full-time employees eligible\nWork Remotely:\nTemporarily due to COVID-19",
    "title": "Java Developer",
    "required_skills": []
  },
  {
    "id": "jd_000053",
    "text": "Node js developer\n\nThe iOS Swift Developer will be an individual contributor in a project that's already up and running on android. You must have Knowledge of:\n1. Swift (9/10 or more)\n2. realm.io (8/10 or more)\n3. Node Js (8/10 or more)\n4. REST API (to fetch and Exchange data - postman)\n4. Sqlite (7/10 or more)\nYou will have an opportunity to apply your skills and expertise to design an innovative application that solves complex problems and enhance performance and productivity.\nKey Responsibilities :\nAdapt Design, implement, deliver, test innovative iOS Swift applications while understanding our products from both a technical and product perspective\nCommunicate with leadership, product owners, other technologists, and users to create working software based on an understanding of business and technical priorities\nBreak down complex problems into elegant technical solutions to intelligently solve problems\nActively contribute to the adoption of strong software architecture, development of best practices, and new technologies.\nApplication Deadline: 18/12/2020\nJob Type: Full-time\nSalary: ₹368,861.00 - ₹942,680.00 per year\nBenefits:\nCell phone reimbursement\nCommuter assistance\nFlexible schedule\nHealth insurance\nInternet reimbursement\nPaid sick time\nPaid time off\nWork from home\nSchedule:\nDay shift\nSupplemental Pay:\nPerformance bonus\nYearly bonus\nExperience:\ntotal work: 1 year (Required)\nProgramming Languages needed:\nSwift (Required)\nWork Remotely:\nTemporarily due to COVID-19",
    "title": "Node js developer",
    "required_skills": []
  },
  {
    "id": "jd_000054",
    "text": "PHP Developer\n\nKey Responsibilities: -\nWorking in a cross-functional team, collaborating with peers during the entire SDLC\nGood hands-on programming skills with Codeigniter & Core PHP, Laravel, CakePHP, Zend for application development & Magento experience will be an advantage, Must have good knowledge of OOPS Concepts.\nResponsible for the creation and implementation of a wide variety of Web-based products using PHP, JavaScript, MySQL and AJAX, JQuery, HTML.\nDevelop, record and maintain cutting edge web-based PHP applications on portal plus premium service platforms.\nEnsure to resolve identified issues related to PHP development to different customers varying from senior managers to varied technical personnel.\nRequired Skills: -\nBasic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3\nFamiliarity with SQL/NoSQL databases and their declarative query languages.\nStrong familiarity with Git,with REST API.\nGood web application troubleshooting, debugging skills\nJob Types: Full-time, Volunteer, Walk-In\n\nSalary: ₹10,470.00 - ₹43,036.00 per month\n\nSchedule:\nDay shift\nSupplemental Pay:\nOvertime pay\nExperience:\nsoftware development: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nLicence:\nCore PHP (Preferred)\nProgramming Languages needed:\nPython (Preferred)\nWork Remotely:\nTemporarily due to COVID-19",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000055",
    "text": "PHP Developer\n\nHiring for PHP- Laravel Developers\n\nExperience: 3-5 years\n\nLocation: Kinfra Park, Trivandrum\n\nCandidate should have at least 1 year experience with laravel framework\n\nJob Type: Full-time\n\nWork Remotely:\n* Temporarily due to COVID-19",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000056",
    "text": "DevOps Engineer\n\nAs an industry leader and Software-as-a-Service provider our mission at 8x8, Inc. (NYSE:EGHT) is to transform the future of business communications. The 8x8 Open Communications Platform (TM) uniquely brings together Voice, Video, Collaboration, Contact Center, and enterprise-class API solutions, helping businesses across the globe transform their customer and employee experience, and empowering workforces worldwide to work smarter.\n\nFor additional information, visit www.8x8.com, or follow 8x8 on LinkedIn, Twitter, and Facebook.\n\nWe are looking for a DevOps Engineer to take part in the development of our communication platform. You will be part of the Engineering team, responsible for automated deployments, ensuring highest reliability and scalability of our production services and efficiently manage our cloud platform infrastructure.\n\nOur ideal candidate is a professional with experience in automating deployments with modern configuration and deployment management systems. He/She requires a broad knowledge of systems, servers, load balancers, storages, security, networking and some background in programming. We are using cloud infrastructure (AWS), containerization, CI and CD process.\nMain Responsibilities:\nAutomate builds, deployments and other aspects of release lifecycle\nMaintain and improve cloud platform infrastructure and configure auto-scaling\nArchitecture and develop Docker-based infrastructure\nFind solutions to problems that disrupt availability, performance and stability of our systems\nWork in conjunction with development and operations team to understand requirements for functionality, performance and security of applications\nExplore and maintain understanding of the internal architecture and client requirements to our applications\nManage the processes of deployments using blue-green deployment pattern whenever possible\nImplement the tools and processes for monitoring servers and services\nEnsure proper backup and restore when failure occurs\nSuggest ways to improve and reduce operational costs with adaptive performance tuning\nInvestigate and develop skills in new technologies, collaborate across the company\nDesired Skills and Experience:\n\nComputer Science degree, or equivalent experience\nPractical experience of building and operating platform in AWS (EC2, ECS, ELB, VPC)\nExperienced in Jenkins\nStrong experience in managing high-load and auto-scaling production environment\nProgramming experience in any scripting language (like Python)\n7+ years of experience working on admin level with Linux and Windows\nExperience working with configuration management frameworks like Puppet, Chef, Ansible\nStrong experience in managing cluster setup of RabbitMQ, Redis, Mongodb.\nStrong in Docker and Kubernetes\nFamiliar with Terraform and Spinnaker\nFamiliar with ELK stack and central log management\nCloud monitoring tools\nBonus points for experience with the followings:\nExperience of working in Agile environment, in a close collaboration with developers\n\nQualifications\nDegree in Engineering from a leading university\nWritten and verbal fluency in English is required\n\nRemuneration\nCompetitive salary with attractive bonus\n\n\n8x8 is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.\n\nFor 8x8 jobs located in the US: 8x8 participates in the E-Verify program.\nView the Participant Poster in English | Español.\nView the Right to Work Poster in English | Español.\n\nWe also provide reasonable accommodation to individuals with disabilities in accordance with applicable laws. Learn more or email us at careers@8x8.com (Include “Reasonable Accommodation” in the subject line)\n\nFor European Job Applicants our Job Applicant Privacy Notice can be found here.",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000057",
    "text": "Wordpress Developer\n\nPlease write back with your CV to and hr@rabsnetsolutions.com.\nDesignation: WordPress Developer\n\nPrimary skills:\nEducational Qualification: Bsc.IT/Msc.IT/BCA/MCA/BE.IT\n\nJob Description\n\nWe are seeking a WordPress Developer responsible for both back-end and front-end development, including creating WordPress themes and plugins. This position requires a combination of programming skills (namely PHP, HTML5, CSS3, and JavaScript) and aesthetics (understanding element arrangements on the screen, the color and font choices, and so on). The candidate should have a strong understanding of industry trends and content management systems. Experience with the responsive and adaptive design is strongly preferred. Also, an understanding of the entire web development process, including design, development, and deployment is preferred.\n\nResponsibilities\n\nDesigning and implementing new features and functionality\nEstablishing and guiding the website’s architecture\nEnsuring high-performance and availability, and managing all technical aspects of the CMS\nHelping formulate an effective, responsive design and turning it into a working theme and plugin.\n\nSkills and Qualifications\n\nGood understanding of front-end technologies, including HTML5, CSS3, JavaScript, jQuery\nExperience building user interfaces for websites and/or web applications\nExperience designing and developing responsive design websites\nComfortable working with debugging tools like Firebug, Chrome inspector, etc.\nAbility to understand CSS changes and their ramifications to ensure consistent style across platforms and browsers\nAbility to convert comprehensive layout and wireframes into working HTML pages\nKnowledge of how to interact with RESTful APIs and formats (JSON, XML)\nProficient understanding of code versioning tools {{such as Git, SVN, and Mercurial}}\nStrong understanding of PHP back-end development",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000058",
    "text": "DevOps Engineer\n\nDESCRIPTION\n\nJob Department: Operations\n\nJob Title: DevOps Engineer\n\nJob Location: Bangalore, India\n\nJob Description:\n\nThe Syncron Operations Team is seeking engineers that enjoy solving problems, working with customers, have a strong technical background in application management and software development including Terraform, Git, Gerrit, Jenkins and at least one popular programming language (Python preferred). Do you have experience as a Systems Administrator working with Linux or Unix and understand the advantages of working in a highly distributed virtual environment? Can you read and troubleshoot code snippets? You will be responsible for deploying, automating, maintaining, troubleshooting and improving the systems that keep the backend infrastructure running smoothly. The role requires you to have hands-on technical experience and a can-do approach towards environment automation / management and continuous improvement. The role will encompass the use of a broad range of AWS technologies including but not limited to EC2, RDS, Lambda, IAM, Athena, VPCs, Terraform, etc with an emphasis on the implementation of best practice cloud security principles If you fit the description, you might be the person we are looking for!\n\nResponsibilities:\n\nTroubleshoot application deployments, recreate customer issues, build proof of concept applications.\nApply advanced troubleshooting techniques to provide unique solutions to our customers' individual needs\nBuild and maintain the backbone of the Syncron infrastructure in AWS cloud\nBuild and maintain Terraform deployments, Jenkins pipelines and shell and Python scripts to automate and deploy AWS\nCollaborate and help build utilities and tools for internal use that enable you and your fellow Syncron Engineers to operate safely at high speed and wide scale\nLeverage your day-to-day experiences to provide feedback on customer experience to internal Syncron teams\nDrive communication during critical events\nWrite tutorials, how-to, and other technical articles\nWork on critical, complex problems that will span multiple AWS services and Syncron products\nLearn and use groundbreaking technologies\n\nRequirements:\n\nSystems administration (Linux based Operation System)\n2+ years of experience in a DevOps role, or experience setting up, maintaining and coordinating the automated patch and configuration management of production servers\nExperience with Infrastructure as a Code tools, preferably Terraform\nExperience with CI/CD tools, preferably Jenkins, particularly pipelines to automate deployment and maintenance of Linux application servers.\nProgramming/scripting with Python and/or Bash. Other languages a bonus\nExperience managing full 3 tier application stacks from the OS up through custom applications\nExcellent written and oral communication skills\nExperience with AWS, GCP or Azure. AWS Certificates would be a plus\n\nAbout Syncron\n\nSyncron empowers the world’s leading manufacturers to maximize product uptime and deliver exceptional after-sales service experiences while driving significant revenue and profit improvements. From industry-leading investments in research and development to provide the fastest time-to-value, Syncron’s award-winning, cloud-based service parts inventory, price, order and uptime management solutions are designed to continually exceed customer expectations. Top brands from around the world trust Syncron to transform their after-sales service operations into competitive differentiators. For more information, visit syncron.com\n\nAs data controller of your personal data, we are required to provide you with several information to foster your data privacy rights. Please read them here.",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000059",
    "text": "Wordpress Developer\n\nWe are looking to hire a skilled WordPress Developer to design and implement attractive and functional websites and Portals for our Business and Clients. You will be responsible for both back-end and front-end development including the implementation of WordPress themes and plugins as well as site integration and security updates.\n\nTo ensure success as a WordPress Developer, you should have in-depth knowledge of front-end programming languages, a good eye for aesthetics, and strong content management skills. Ultimately, a top-class WordPress Developer can create attractive, user-friendly websites that perfectly meet the design and functionality specifications of the client.\nWordPress Developer Responsibilities:\nMeeting with clients to discuss website design and function.\nDesigning and building the website front-end.\nCreating the website architecture.\nDesigning and managing the website back-end including database and server integration.\nGenerating WordPress themes and plugins.\nConducting website performance tests.\nTroubleshooting content issues.\nConducting WordPress training with the client.\nMonitoring the performance of the live website.\nWordPress Developer Requirements:\nBachelor’s degree in Computer Science or a similar field.\nProven work experience as a WordPress Developer.\nKnowledge of front-end technologies including CSS3, JavaScript, HTML5, and jQuery.\nKnowledge of code versioning tools including Git, Mercurial, and SVN.\nExperience working with debugging tools such as Chrome Inspector and Firebug.\nGood understanding of website architecture and aesthetics.\nAbility to project manage.\nGood communication skills.\nContract length: 12 months\n\nExpected Start Date: 9/11/2020\n\nJob Types: Full-time, Contract\n\nSalary: ₹12,004.00 - ₹38,614.00 per month\n\nSchedule:\nFlexible shift\nExperience:\nWordpress: 3 years (Required)\nweb designing: 2 years (Required)\ntotal work: 3 years (Required)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nYes",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000060",
    "text": "Machine Learning\n\nAmazon strives to be Earth's most customer-centric company where people can find and discover virtually anything they want to buy online. By giving customers more of what they want - low prices, vast selection, and convenience - Amazon continues to grow and evolve as a world-class e-commerce platform. Amazon's evolution from Web site to e-commerce partner to development platform is driven by the spirit of innovation that is part of the company's DNA.\n\nAmazon Seller Services is looking for a Data Scientist to work hands on from concept to delivery on statistical analysis, prescriptive and predictive analysis, and machine learning implementation projects. We are looking for a problem solver with strong analytical skills and a solid understanding of statistics & Machine learning algorithm as well as a practical understanding of collecting, assembling, cleaning and setting up disparate data from enterprise systems.\nResponsibilities:\n\n· Ability to understand a business problem and the available data and identify what statistical or ML techniques can be applied to answer a business question\n· Given a business problem, estimate solution feasibility and potential approaches based on available data\n· Understand what data is available, where, and how to pull it together. Work with partner teams where needed to facilitate permissions and acquisition of required data\n· Quickly prototype solutions and build models to test feasibility of solution approach\n· Build statistical models/ ML models, train and test them to and drive towards the optimal level of model performance\n· Work with technology teams to integrate models by wrapping them as services that plug into Amazon's marketplace and fulfillment systems\n· Work across the spectrum of reporting and data visualization, statistical modeling and supervised learning tools and techniques and apply the right level of solution to the right problem\n· The problem set covers aspects of detecting fraud and abuse, improving performance, driving lift and adoption, recommend the right upsell to the right audience, cost saving, selection economics and several others.\n\nBasic Qualifications\n\n· A MS or PhD in Computer Science or Machine learning or Operational research or Statistics or in a quantitative field.\n· 5+ year of experience and an advanced degree in a technical field, preferably statistics, math or computer science is desired\n· A very strong grounding in applied statistical modeling and a very strong grasp of statistical concepts. Must be comfortable in the world of numbers, models, and algorithms\n· A strong level of proficiency in Python is required\n· Willingness to dive deep and work on difficult and ambiguous problems with unknown outcomes.\n· Ability to partner and work efficiently with partner teams and stakeholders is critical.\n· Strong grasp of machine learning, data mining and data analytics techniques\n· Strong Problem solving ability.\n· Understanding of how to apply predictive and machine learning techniques like logistic regression, random forest, GBM, Neural Nets, SVM etc is required\n· Understanding of databases (RDBMS, NOSQL) from a perspective how to write queries and pull data from them is essential.\n\nPreferred Qualifications\n\n· A strong level of proficiency in SAS, R is preferred\n· Past experience of putting Machine Learning model in production is preferred.\n· Past publications in journals of repute.\n· Conceptual understanding of Hadoop and cloud computing like AWS is preferred\n· Demonstrated participation in contests like Kaggle is a plus\n· Experience in the eCommerce, marketplace or supply chain areas is a plus.",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000061",
    "text": "JavaScript Developer\n\nJavascript developers\n\nAs a javascript developer you’ll be responsible for creating frontend application using angular and other similar frameworks.\n\nYou’ll be working with an amazing team of frontend developers to package JS applications to be deployed on iOS and android devices.\n\nYou will need to have experience in integrating different third party APIs using JS, to provide functionality to our websites and apps.\n\nExperience with frontend development frameworks, jQuery and Git will be a bonus.\n\nEmail your CV",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000062",
    "text": "DevOps Engineer\n\nExperience 5-10 Years\nWork location Bangalore\nBase location Bangalore\nCTC/Budget 20-24 LPA\nTechnology AWS , CLOUD, DEVOPS\nAdditional Information\n\nWe have an opportunity with with one of our reputed client in Bangalore for DevOps Engineer .\n\nExp: 5-8 Years, CTC :20-24 LPA (Inclusive 8% Variable)\n\nInterview Process: Questionnaire + WebEx Round (Should be available to complete assignment in weekdays and should be ready for 90 Min WebEx round)\n\nSkill Required (Technical)\n\nIncidents,Production,CI/CD,designing,JBoss,Testing,solution selling,cloud,schedules,indian institute of Technology,QA,aws,SDLC,implementation,solution,devops,automation,Apache Tomcat,scripting,planning,Leadership HIring,developing,Production support,logistic documentation,infrastructure,application development,product development,Python,life insurance,django,perl scripting,Quality Assurance,technology,coordination,IT infrastructure,Processes,transformation,IT product,Java,architecture,support,maintenance,Linux,Advance Excel,Ruby on Rails,strategy,reporting,Automation Testing,tomcat,Solr,orchestration\n\nSkill Required (Other)\n\nVery Good communication skills\n\nReady to work in bangalore\n\nResponsibilities",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000063",
    "text": "JavaScript Developer\n\nProduct Operations Specialist\n\n\nThe Product team of a leading Cisco solution (Cisco DNA Spaces) is looking to hire a Product Ops Specialist that is skilled in integrating SaaS products with CRM, automation and analytics tools such as HubSpot, Pendo and Salesforce. You will be responsible for personalizing the product experience for its users by integrating third party tools, handling and growing the analytics, reporting and campaigns function for the product. You have solid experience with tools such as HubSpot Marketing/Sales/Services hub management, Pendo, Salesforce, campaign management, email sequences, landing page design, list segmentation and optimization of workflows. Beginner-intermediate experience in HTML, CSS & Javascript would be good to have.\n\nWhat You'll Do\n\n\nThe Candidate will be part of the Product Management function of Cisco DNA Spaces (one of the fastest growing SAAS products) and will be responsible for\n\nCampaign Management\nEnsure all product user campaigns are delivered on time, with accurate segmentation to maximize engagement\nDevelop and handle monthly email calendar to document and schedule all email communications\nBuild strategic campaigns, engagement drips, and dynamic content variables, including templates\nStay abreast of and recommend marketing automation tools and best practices with coding, design, and A/B testing of email campaigns\nWorking with global teams to gather findings about how internal marketing tools are handled, maintained and continue to build use cases that build efficiencies in developing operational excellence\nContributing to the development and testing of new tool features\nDatabase & CRM Management\nLead data management and hygiene - list scrub, upload, basic cleanse and management, unsubscribes/opt-outs, list imports\nStandardize, clean, and upload contact lists\nBuild and maintain segmented lists of different target audiences\nResponsible for CRM based report generation and analytics creation.\nAutomation\nBuild, manage and improvise various workflows\nBuild, troubleshoot, and maintain web forms and form handlers for a variety of transactional and marketing purposes\nCoordinate the proper use of forms and completion actions needed to support campaign objectives\nManage setup of product analytics tools.\nWho You'll Work With?\n\nYou will be working with the Enterprise Networking Product management team. This group owns Cisco DNA Spaces, the world’s most powerful location cloud platform that has already digitized over two billion sq. ft. of enterprise airspace - and we are just getting started.\n\nRead more about us at https://dnaspaces.cisco.com. As Cisco moves towards a more software focused strategy, this is a great time to shape the future of the wireless business by taking to market an innovative SaaS solution such as DNA Spaces.\n\nDNA Spaces growth is driven by continuous innovation and a team that pushes boundaries to drive product activation and adoption at scale.\n\nWho You Are\nYou’re a HubSpot and Marketing Automation champion with an ability to operate in fast-paced, handle and organize multiple data streams to make sense out of it.\nYou have handled integration of tools such as Salesforce, Pendo or HubSpot in the past.\nYou have strong expertise in creating and handling email campaigns including template designs, calls-to-action, A/B tests and reporting\nYou’re agile and have a data-driven approach to problem solving, and a commitment to driving product awareness and adoption\nYou have excellent attention to detail and ability to self-manage through complexity\nSkills\nExpertise in HubSpot Marketing/Sales/Services hub management, campaign management, email sequences, landing page design, list segmentation and optimization of workflows.\nExperience with other Sales & Marketing automation (Salesforce, Eloqua, Pardot, etc.) & Product Analytics tools (Pendo, Amplitude, etc.)\nUnderstanding of HTML, XML, and Excel skills along with an understanding of web development.\nExpertise in understanding data, finding trends, building reports and snippets from the results, and optimizing for scale.\nExcellent analytical, organizational & troubleshooting skills\nExcellent English (spoken and written) communication skills\nSolid understanding of performance marketing, conversion, and online customer acquisition\nExperience & Education:\n\nMust have 1-2 years’ experience on HubSpot (HubSpot Certification preferred) or Salesforce\nMinimum 3 years of demonstrated ability in marketing operations, email marketing and reporting\nStrong data management abilities\nBasic understanding of HTML - for emails, landing pages\nAny Bachelor's degree.\nA background or degree in business /data analytics is a plus\nWhy Cisco\n\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.\n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000064",
    "text": "iOS Developer\n\nWe would love to have you on-board if:\n\nBuild the app features for the iOS platform\nWork closely with design and engineering teams to build and ship end to end features.\nUnit-test code for robustness, including edge cases, usability, and general reliability.\nWork on bug fixes and improving app performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency.\n\nYou need to have:\n\n3+ years of software development experience\n1+ years of iOS development\nHave published one or more iOS apps in the app store\nA deep familiarity with Objective-C, Swift and Cocoa Touch\nExperience working with iOS frameworks such as Core Data, Core Animation, Core Graphics and Core Text\nUI development with Interface Builder and Code, including Auto-Layout\nExperience with third-party libraries and APIs\nWorking knowledge of the general mobile landscape, architectures, trends, and emerging technologies\nSolid understanding of the full mobile development life cycle\nYou deeply care about user experience.\n\nAt Scandid you will:\n\nArchitect, Design and build advanced features for iOS Application.\nGood hands on API and Analytics.\nDesign, develop, debug, Test and deploy the Mobile solution\nWork on bug fixing and improving application performance.\nContinuously discover, evaluate, and implement new technologies to maximize development efficiency\n\nIf you're excited about:\n\nBeing a part of company doing some really amazing stuff.\nMaking a splash in a upcoming India’s first multi-store, multi-category scanner app\nLearning & Growing far beyond your current horizon\nCompetitive Compensation with the usual benefits.\nA place full of like-minded & ridiculously smart folks\nA start-up culture that you'd cherish forever in your work life",
    "title": "iOS Developer",
    "required_skills": []
  },
  {
    "id": "jd_000065",
    "text": "Flutter Developer\n\nHave two or more iOS/Android apps developed with Flutter. Either deployed on the AppStore/Google Play or available on Github\nAtleast 1 year of experience in mobile software development using Flutter\nExperience with third-party libraries and APIs integration\nShould have knowledge about Firebase, SQL, Javascript\nUnderstanding of the Agile development life-cycle\nJob Type: Full-time\nSalary: ₹20,000.00 - ₹30,000.00 per month\nSchedule:\nDay shift\nMonday to Friday\nExperience:\nDeveloper: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nYes",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000066",
    "text": "Node js developer\n\nDesired Skills: *\nWeb API development using Node.js.\nExperience in Angular JS/ API development.\nGit repository knowledge.\nMongo DB a plus.\nJob Roles/Responsibilities*\nExperience leading technical application development projects and systems analysis projects.\nExperience in the full life cycle of next-generation IT applications, including secure coding practices.\nAble to identify and recommend best practices.\nExperience in creating project Work Breakdown Structures, estimates, resource allocations, and milestones.\nAble to understand customer needs and create systems requirements that allow implementation.\nStrong Javascript front-end/back-end development experience.\nExperience in technologies such as Node.js (must have),\nExperience with Node.js utility libraries.\nContact Number : 9222 37 9222\n\nJob Type: Full-time\n\nSalary: ₹8,000.00 - ₹20,000.00 per month\n\nExperience:\nwork: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nEducation:\nSecondary(10th Pass) (Preferred)",
    "title": "Node js developer",
    "required_skills": []
  },
  {
    "id": "jd_000067",
    "text": "JavaScript Developer\n\nSoftware Engineer: Javascript\n\nAbout Naehas\n\nJoin a pre-IPO, fast-paced, rapidly growing software as a service company based in Silicon Valley. Naehas is a marketing offer and content orchestration platform that supports some of the largest consumer brands in the world. Our customers include four of the top six banks and market leaders in media, communication and insurance.\n\nWe’re expanding our office in the Gurugram area (India) and would like to fill it with team members who value autonomy, collaboration and meaningful work. Our recipe for success is very simple - “Passionate and happy employees translate into happy customers and a world-class product”.\n\nAbout the Position\n\nWe are seeking to hire a passionate Software Engineer to build features for our flagship naehas’ Platform.\n\nBasic Requirements:\n\nHands on with AngularJS or EmberJS JavaScript Development Framework\nJavaScript developer with at least 1 Yr hands-on experience.\nUnderstanding of HTML5 Features and its development\nHands on BackBoneJS, Framework 7, KnockoutJS is Plus.\nSolid knowledge of javascript and css3, bootstrap.\nPrior experience working on enterprise web applications is a plus.\nKnowledge of working with RESTFul API's\nNeeds to be able to produce code in a fast paced environment.\nStrong problem solving and debugging skills required. -\nPreferred Qualifications:\n\nLeading individual projects/sub-projects.\nLeading team of 2-6 members.\nComputer Science degree from a selective university.\n\nNaehas is a company of people committed to:\n\nProviding the Customer with the finest software backed by consistently top-quality service.\nDelivering our software and services efficiently, thus ensuring fair prices to the Customer and a sound investment for the shareholder.\nTreating the Customer as we expect to be treated –putting the Customer first every day -and meaning it.\nBeing leaders in innovation, quality, efficiency, and Customer satisfaction. Being known for doing the little things and the big things well.\nInsisting on an inclusive environment where every single person is given the encouragement, support, and opportunity to be successful.\nExpecting and accepting from ourselves nothing short of the best. Remembering that each of us makes the unassailable difference.\n\nNaehas is a company of people who expect to:\n\nBe treated fairly. • Work hard in an environment absolutely committed to excellence and Customer satisfaction.\nWork with people who respect each other as important individuals. • Have meaningful work to do and the education, equipment, and support to do it.\nKnow what is required of them and be kept candidly informed of their performance and progress.\nBe judged individually by the quality and consistency of their effort, enthusiasm, honesty, and results.\nBe encouraged to offer suggestions and ideas with the understanding that each will be promptly considered and responded to; be able to reasonably speak their minds.\nReceive ample information about the company’s plans, activities, and results. If these values resonate with you then we look forward to meeting you.\n\nIf these values resonate with you then we look forward to meeting you. Here’s what we have to offer you as a team member at Naehas:\n\nCompetitive salary package that will continue to grow as you gain experience.\nA full suite of benefits including health insurance, team parties, outdoor tours, and much more.\nA casual workplace that appreciates and respects each employee's ideas.\nThe agility of a growing and profitable start-up environment building marketing solutions for the largest Fortune 50 customers.\nMentor-ship by some fabulous engineers with a track record of delivering major pieces of software for both large companies and successful startups.\nFlexible work arrangements.",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000068",
    "text": "PHP Developer\n\nDevelopment of high quality web applications like online communities, e commerce solutions, content management system and web-portals.\n\nExperience: 2 - 5 years.\n\n2+ years of software development experience in PHP.\n\nHands on Experience on open source project Joomla (Mandatory).\n\nExperience on web technologies including HTML, Javascript, JQuery.\n\nWorking Experience on Mysql and relational databases, version control tools and web services.\n\nRequired Skills:\nPHP, Joomla",
    "title": "PHP Developer",
    "required_skills": []
  },
  {
    "id": "jd_000069",
    "text": "Database Administrator\n\noverview cure start fred hutchinson cancer research center home three nobel laureate interdisciplinary team world-renowned scientist seek new innovative way prevent diagnose treat cancer hiv/aids life-threatening disease fred hutch ’ pioneering work bone marrow transplantation led development immunotherapy harness power immune system treat cancer independent nonprofit research institute based seattle fred hutch house nation ’ first cancer prevention research program well clinical coordinating center woman ’ health initiative international headquarters hiv vaccine trial network career start database administrator iii work closely customer peer troubleshoot complex technical problem ensure smooth operation database server database application dba iii responsible maintaining data integrity protecting data loss responsibility general guidance database administrator iii expected perform range complex assignment project established solution s/he expected provide solution unique complex problem contribute process improvement within database team act resource mentor le experienced colleague dba iii ha in-depth knowledge database application administration expected subject matter expert one area application support limited tier 2 support customer application ; tier 3 support customized application ; tier 3 backup support enterprise application position may perform following responsibility serve technical lead large complicated project provide new improved database service install configure maintain decommission database server database customer/customized application includes initial installation upgrade patching migration on-prem cloud implementation troubleshoot complex issue database platform database customer application design deliver formal informal presentation variety technical topic peer colleague lead hardware/software evaluation database server database platform lead technical evaluation customer application cit participate technical evaluation enterprise application contribute effort improve process meet strategic goal within dba team across multi-disciplinary group fulfill day-to-day operational task associated database application support design implement script perform etl provide 24/7 support mission critical application database rotating basis limited database platform database customer application serve backup 24/7 support enterprise application architect monitor report database application usage availability ensure proper database monitoring alerting response control limit database access compliance data security policy best practice maintain data integrity monitor database server query high performance create technical documentation diagram comprehensive understandable comply departmental process change management problem management incident management duty assigned qualification professional skill ability analyze provide creative innovative solution complex technical problem proven track record coaching mentoring team member practice personal improvement continuous professional technical education training demonstrate excellent customer service relationship building ability interact successfully communicate clearly must exercise high degree discretion judgment dealing customer vendor fred hutch staff promote positive safe work environment minimum qualification bachelor 's degree preferably computer science information system related field ; equivalent work experience 7+ year experience technical position querying experience sql exposure increasing responsibility strong knowledge sql server administration experience cloud based computing microsoft azure and/or aws solid analytical troubleshooting problem solving skill able work cooperatively establish positive working relationship cross-functional team including customer service system storage administrator networking technician reliable self-starter work independently member team strong organizational interpersonal communication written verbal presentation skill demonstrated ability understand long-term impact choice communicate others commitment diversity committed cultivating workplace diverse perspective experience welcomed respected proud equal opportunity vevraa employer discriminate basis race color religion creed ancestry national origin sex age disability marital veteran status sexual orientation gender identity political ideology membership legally protected class affirmative action employer encourage individual diverse background apply desire priority referral protected veteran due disability need assistance/and reasonable accommodation application recruiting process please send request employee service center escmail @ fredhutch.org calling 206-667-4700",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000070",
    "text": "Flutter Developer\n\nMust have Worked with Flutter / Android Application Development.\nExcellent Ability to Develop & Understand Algorithms\nExcellent Verbal & Written Communication.\nStrong Knowledge in Restful Web Services. Experience in Interacting with Web Services from the Flutter Mobile Platform\nExperience with Offline Storage, Threading, and Performance Tuning\nStrong Knowledge in Push Notifications\nStrong Knowledge in API Integrations\nAnalytical, Problem Solving and Decision Making Skills.\nShould have Knowledge On Client Requirements Analysis.\n\nKnowledge in ECommerce Industry will be a plus\n\nJob Type: Full-time\n\nSalary: ₹300,000.00 - ₹360,000.00 per year\n\nExperience:\nFlutter: 2 years (Preferred)\nmobile app development: 2 years (Preferred)\nWork Remotely:\nNo",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000071",
    "text": "Django Developer\n\nSelected intern's day-to-day responsibilities include:\n• Work on both front and back end coding\n• Design user interactions on websites, developing databases for website functionality, integrate various frameworks.\n\nNumber of Internships available: 5\n\nDuration - 3 Weeks\n\nSkill(s) required - Knowledge of C, C++ programming\n\nWho Can Apply\n\n• B.E. / B.Tech / BCA / MCA / B.Sc. / MSc pursuing or pass-out\n\nPerks\n\nCertificate of Internship\nFlexible work hours,\nInformal dress code.\nMentoring by Industry Experts\n\nYou will learn - Develop web applications with Python language and Django framework and MySQL database\n\nInternship Fee - Candidate needs to pay Internship enrolment fee of Rs. 2,500/- (Two Thousand Five Hundred only)\nWebsite : https://codebetter.in\nJob Location : Indore\nYears of Experience : 0 Yrs - 0 Yrs\nAnnual CTC : 100,000 - 120,000\nVenue : 403, Shekhar Central, Palasiya Square, A.B. Road, 452001",
    "title": "Django Developer",
    "required_skills": []
  },
  {
    "id": "jd_000072",
    "text": "Full Stack Developer\n\noverview associate front end/full stack developer prolifics seeking associate front end developer java capability proven javascript framework experience successful candidate part elite consulting team responsible design development implementation solution global 1000 customer key responsibility develop application component based java/angular technology stack part global development team business design session architecture review ensure delivery aligns expectation participate code review support qa initiative ensure high-quality delivery design develop solution using integration design pattern single page application framework best practice skills/qualifications required skill strong communication skill ability interface directly client analyst ensure technical requirement delivery alignment bachelor ’ degree computer science software engineering information technology related field strong analytical design skill including ability understand business requirement translate efficient effective technical design work well within large-scale well-structured enterprise environment effective communication presentation collaboration skill excellent trouble-shooting skill ability quickly identify document root cause issue effectively communicate possible resolution work independently effectively self-directed angular 2 experience oo javascript javascript framework typescript cs html5 experience angular 2/4/5 proven success delivering solution framework ui design experience specifically web application plus java web development servlet/jsp spring framework hands-on experience web application development utilizing java web development purpose primarily spring framework experience development service oriented architecture application good understanding object oriented design design pattern knowledge java server page jsp javascript essential experience mv patterned application using javascript framework preferably angular spring cloud experience plus prolifics 36 year prolifics ha experienced continued growth recognition expertise global service company prolifics provides end-to- end service including architectural advisement design development deployment testing bpm integration security content collaboration solution ha garnered several award technical excellence vision one world ’ admired technology consulting company delivering competitive advantage client benefit prolifics committed providing competitive comprehensive suite benefit fit need employee information benefit offered please refer website http //prolifics.com/careers/benefits-0",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000073",
    "text": "Flutter Developer\n\nResponsibilities and Duties*\nStrong experience of 1 years in Flutter.\nWriting well architecture, testable, efficient code by using best software development practices.\nWorked on either Android Studio\nKnowledge in developing mobile apps with Flutter.\nKnowledge of UI designing using JSX\nDatabase Knowledge\nFamiliarity with Unix/Linux environments.\nExperience in building and triggering APIs.\nKnowledge of developing Front-end and integrate the Back-end services with the applications.\nStrong analytical and problem-solving skills.\nRelevant university degree, specialized training or equivalent work experience.\nAdd on advantage if experience in Ionic / Android native / swift.\nJob Type: Full-time\n\nSchedule:\nDay shift\nExperience:\nAndroid development: 2 years (Preferred)\nwork: 2 years (Preferred)\ntotal work: 3 years (Preferred)\nEducation:\nBachelor's (Preferred)\nProgramming Languages needed:\nJava (Preferred)\nIndustry:\nSoftware Development",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000074",
    "text": "DevOps Engineer\n\nCompany Description\n\nKlearNow is an exciting new company providing an innovative state of the art solutions that brings the global supply chain into the digital age. KlearNow is funded by serial entrepreneurs with proven track record and sizable exits already. We are now building our initial team post the founders and are looking for exceptional talent to join us.\n\nWhy us\n\nGet in on the ground floor of a startup company with a new product offering that is changing the way technology is leveraged in the global supply chain. We are looking for is an experienced DevOps engineer with a passion for systems automation. You will be responsible for managing innovation in our software release processes, increase the robustness and automation. In this role, you will help bring significant gains to how we build and deploy software, all towards the end- goal of achieving releases that are swift, predictable and of the highest quality.\n\nExperience and responsibilities\nParticipate in all aspects of the builds, integration, deployment, merging, tools used and automation for our cloud environments\nTroubleshooting and solve issues relating to mission critical services across the entire stack\nBuild robust monitoring for production systems with Nagios, collectd, Prometheus, and Grafana\nDevelop automation and monitoring tools to help prevent problem recurrence\nDefine metrics and build systems to measure performance and scale, highlighting the biggest bottlenecks\nCraft load tests that prepare our services for large volume of active users\nSupport internal and customer external SLA’s\nServe as an escalation point for any product issues and ability to be on-call duties to provide 24x7x365 services\nDefine and own appropriate compliance audits and reports\nComfortable with continuous integration concepts and tools\nProvide reporting that provides appropriate context to multiple audiences including product owners, engineering, and sales teams\nQualifications\n2+ years / 5+ years (Senior Role) of experience “doing” DevOps, including working at large scale with real, highly concurrent, user traffic across multiple data centers and regions\nExperience supporting production traffic on AWS or another cloud PaaS\nExcellent Linux system administration and automation skills (Ruby, Python, Bash etc.)\nExperience with firewalls and network security technologies at scale\nPassion for implementing best practices with a focus on rapid growth\nSolid hands on skills with at least 50% (75% senior role) of the following:\nServers: Apache, Nginx, Varnish, Memcached, Aerospike, ElasticSearch, Cassandra, RocksDB\nDatabases: MySQL, PostgreSQL\nAutomation tools: Ansible, Puppet, Chef, SaltStack or Terraform\nFrameworks & tools: Nagios, Docker, Vagrant, Network Analysis Tools\nAWS APIs and CLI Tools, EC2 Autoscaling, RDS, S3, Route53\n5+ years’ experience with developing and delivering configuration and deployment automation using configuration automation tools\nAbility to solve mission critical services issues and build automation to proactively detect and prevent their re-occurrences\nExperience with firewalls and network security technologies at scale\nExperience with Agile methodologies and working in a fast-paced small startup\nExcellent written and oral communication skills\nBachelor’s degree in computer science strongly preferred",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000075",
    "text": "DevOps Engineer\n\nPunchh is the leader in customer loyalty, offer management, and AI solutions for offline and omni-channel merchants including restaurants, convenience stores, and retailers. Punchh brings the power of online to physical brands by delivering omni-channel experiences and personalization across the entire customer journey-from acquisition through loyalty and growth-to drive same store sales and customer lifetime value. Punchh uses best-in-class integrations to POS and other in-store systems such as WiFi, to deliver real-time SKU-level transaction visibility and offer provisioning for physical stores.\n\nPunchh is growing exponentially, serves 200+ brands that encompass 91K+ stores globally. Punchh's customers include the top convenience stores such as Casey's General Stores, 25+ of the top 100 restaurant brands such as Papa John's, Little Caesars, Denny's, Focus Brands (5 of 7 brands), and Yum! Brands (KFC, Pizza Hut, and Taco Bell), and retailers. For a multi-billion $ brand with 6K+ stores, Punchh drove a 3% lift in same-store sales within the first year. Punchh is powering loyalty programs for 135+ million consumers.\n\nPunchh has raised $70 million from premier Silicon Valley investors including Sapphire Ventures and Adam Street Partners, has a seasoned leadership team with extensive experience in digital, marketing, CRM, and AI technologies as well as deep restaurant and retail industry expertise.\n\nNumber of Openings: 1\n\nJob Location: Jaipur\n\nExperience Required: Minimum 3 years\n\nAbout the role:\n\nAs a DevOps Engineer for Punchh, you will be working with our developers, SRE, and DevOps teams implementing our next generation infrastructure. We are looking for a self-motivated, responsible, team player who love designing systems that scale. Punchh provides a rich engineering environment where you can be creative, learn new technologies, solve engineering problems, all while delivering business objectives. The DevOps culture here is one with immense trust and responsibility. You will be given the opportunity to make an impact as there are no silos here.\n\nResponsibilities:\n\nDeliver SLA and business objectives through whole lifecycle design of services through inception to implementation.\nEnsuring availability, performance, security, and scalability of AWS production systems\nScale our systems and services through continuous integration, infrastructure as code, and gradual refactoring in an agile environment.\nMaintain services once a project is live by monitoring and measuring availability, latency, and overall system and application health.\nWrite and maintain software that runs the infrastructure that powers the Loyalty and Data platform for some of the world's largest brands.\n24x7 in shifts on call for Level 2 and higher escalations\nRespond to incidents and write blameless RCA's/postmortems\nImplement and practice proper security controls and processes\nProviding recommendations for architecture and process improvements.\nDefinition and deployment of systems for metrics, logging, and monitoring on platform.\n\nMust have:\n\nMinimum 3 Years of Experience in DevOps.\nBS degree in Computer Science, Mathematics, Engineering, or equivalent practical experience.\nStrong inter-personal skills.\nMust have experience in CI/CD tooling such as Jenkins, CircleCI, TravisCI\nMust have experience in Docker, Kubernetes, Amazon ECS or Mesos\nExperience in code development in at least one high-level programming language fromthis list: python, ruby, golang, groovy\nProficient in shell scripting, and most importantly, know when to stop scripting and start developing.\nExperience in creation of highly automated infrastructures with any Configuration Management tools like: Terraform, Cloudformation or Ansible.\nIn-depth knowledge of the Linux operating system and administration.\nProduction experience with a major cloud provider such Amazon AWS.\nKnowledge of web server technologies such as Nginx or Apache.\nKnowledge of Redis, Memcache, or one of the many in-memory data stores.\nExperience with various load balancing technologies such as Amazon ALB/ELB, HA Proxy, F5.\nComfortable with large-scale, highly-available distributed systems.\n\nGood to have:\n\nUnderstanding of Web Standards (REST, SOAP APIs, OWASP, HTTP, TLS)\nProduction experience with Hashicorp products such as Vault or Consul\nExpertise in designing, analyzing troubleshooting large-scale distributed systems.\nExperience in an PCI environment\nExperience with Big Data distributions from Cloudera, MapR, or Hortonworks\nExperience maintaining and scaling database applications\nKnowledge of fundamental systems engineering principles such as CAP Theorem, Concurrency Control, etc.\nUnderstanding of the network fundamentals: OSI, TCI/IP, topologies, etc.\nUnderstanding of Auditing of Infrastructure and help org. to control Infrastructure costs.\nExperience in Kafka, RabbitMQ or any messaging bus.\n\nBenefits:\n\nMedical Coverage, to keep you and your family healthy.\nCompensation that stacks up with other tech companies in your area.\nPaid vacation days and holidays to rest and relax.\nHealthy lunch provided daily to fuel you through your work.\nOpportunities for career growth and training support, including fun team building events.\nFlexibility and a comfortable work environment for you to feel your best.\n\nPunchh is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. If you'd like more information about your EEO rights as an applicant, please click here.\n\nWe also provide reasonable accommodations to individuals with disabilities in accordance with applicable laws.\n\nNotice to recruiters and placement agencies: If you are a recruiter or placement agency, please do not submit résumés to any person or email address at Punchh prior to having a signed agreement with Human Resources. Punchh is not liable for and will not pay placement fees for candidates submitted by any agency other than its approved recruitment partners. Also, any résumés sent to us without an agreement in place will be considered your company's gift to Punchh and may be forwarded to our Talent Acquisition team.",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000076",
    "text": "JavaScript Developer\n\nCome join our army of exceptional developers responsible for delighting our customers and internal users. To succeed in this role, you must be:\n\nMust Have:\n\nAn excellent problem solver.\nHave a good understanding of inheritance and appreciation for object oriented programming concepts in Javascript\nDemonstrate familiarty and comfort with Javascript libraries and their quirks, workarounds. (Knowing how to use DOM manipulation frameworks like Jquery and doing validationsor writing an 'if' condition does not necessarily = knowing Javascript)\nHave an Intermediate level understanding of HTML5, CSS3 Hands-on experience with any of the JS Frameworks like Angular, React, Backbone etc.\nComprehensive experience with asynchronous request handling, partial page updates, AJAX\nA minimum of 2 years full-time experience as a Javascript Developer",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000077",
    "text": "Wordpress Developer\n\nJob Summary\nPublished on : 9 months ago\nVacancy : 4\nEmployment Status : Full Time\nExperience : 3 - 6 Yrs\nSalary : 25000-50000\nInterview Venue : Skype\nJob description -\nDesigning and implementing new features and functionality\nEstablishing and guiding the websites architecture\nEnsuring high-performance and availability, and managing all technical aspects of the CMS\nHelping formulate an effective, responsive design and turning it into a working theme and plugin.\n\nRole And Responsibilities -\nMinimum of 2 years of experience in coding with WordPress.\nHands-on experience with Web development technologies, including PHP, HTML, CSS, JavaScript\nDemonstrated, excellent skills in custom theme creation customization, plugin selection and customization\nKnowledge in implementation of APIs in PHP / Laravel or similar stacks is a plus.\n\nSkills\n\nWeb API , PHP , HTML , CSS , IT Software ,\n\nQualifications\n\nDegree",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000078",
    "text": "Full Stack Developer\n\n’ small team experienced developer determined change modern mobility including entrenched car rental industry emphasize team ownership iterative development moving fast without breaking thing ’ looking someone drive development restful apis building rapidly scaling backend ideal candidate experience web programming comfortable working aws infrastructure know whatever framework library currently use open mastering new framework necessary currently hiring full-stack engineer experience level sde sde ii senior sdes applicant minimum 1+ year professional software development experience fluency least one dynamic language ruby preferred silvercar might building apis client facing apps ruby rail interacting data store like rds elasticache redis others creating maintaining scalable infrastructure leveraging modern aws product building amazing ux client side apps angular bootstrap j framework writing test documentation work feature development scrum team maintaining expertise current emerging technology tool technical friend would say really grok ci jenkins etc source control tool git ca n't go sleep knowing test failing really know scalable infrastructure love agile development delivering code make thing work get thing done great communicator would never consider rockstar ninja know automotive bus think unlocking audi via ssh sound awesome non-tech friend might even say make excellent informed decision know ask advice take work seriously ’ take seriously enjoy mentoring others leading example love learn new thing quickly like working team leave thing better found offer competitive base salary bonus incentive eligibility full benefit medical dental vision 401k pto working dynamic team downtown austin alongside developer product-owners friendly small company environment progressive culture flexible hour backed 107 year old automotive industry leader",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000079",
    "text": "Full Stack Developer\n\nsnapstream small agile tech company based washington/heights area houston full intelligent self-starter work hard lot fun casual office flexible hour free food great people seeking newest initiate currently looking full-time senior full-stack developer engineering team want make big impact design implementation product ? snapstream snapstream engineer key ingredient success take hiring seriously strive strengthen team passionate talented software developer join u long-haul requirement bachelor ’ degree technical field c ce preferred excellent mastery common data structure algorithm excellent programming skill c++ excellent programming skill c java excellent understanding full stack excellent technical communication skill excellent understanding software security experience source control ability think act like user least 7 year professional software development experience commercial software preferred skill tool experience tech lead least one major project c++ c java html cs javascript jquery visual studio bonus skill tool asp.net mvc signalr directshow android io ux benefit snapstream offer health insurance vision dental life insurance flexible spend account fsa paid vacation 401k plan addition fund gym membership promote fitness supply smart coworkers great work environment flexible hour relaxed dress code kitchen stocked snack health food red bull fruit whatever else think",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000080",
    "text": "Node js developer\n\nDear Candidate,*\nGreetings from *Tech Integrity Service!*\n\nWe are Hiring for Node.js Developers. The ideal candidate for this role will have a minimum experience of 1 year. If your profile matches below then share your CV at the given email.\nResponsibilities : *\nIntegration of user-facing elements developed by front-end developers with server-side logic\nWriting reusable, testable, and efficient code\nDesign and implementation of low-latency, high-availability, and performant applications\nImplementation of security and data protection\nDesired Candidate Profile : *\nStrong proficiency with JavaScript or CoffeeScript depending on your technology stack.\nKnowledge of Node.js and frameworks available for it such as Express, StrongLoop, etc depending on your technology stack.\nUnderstanding the nature of asynchronous programming and its quirks and workarounds.\nGood understanding of server-side templating languages such as Jade, EJS, etc depending on your technology stack.\nGood understanding of server-side CSS preprocessors such as Stylus, Less, etc depending on your technology stack.\nBasic understanding of front-end technologies, such as HTML5, and CSS3\nLet me know if you are interested in this opportunity.\nRegards,*\nTech Integrity Services*\nJob Type: Full-time\n\nSalary: Up to ₹20,000.00 per month\n\nSchedule:\nFlexible shift\nSupplemental Pay:\nOvertime pay\nExperience:\nnode.js: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nNo",
    "title": "Node js developer",
    "required_skills": []
  },
  {
    "id": "jd_000081",
    "text": "Flutter Developer\n\nJob Summary\n\nWe are looking for the senior core PHP developer for our team. Working closely with the development team lead, you will be able to work independently to create code and add value to the project team.\n\nResponsibilities and Duties:\nCreate multi-platform apps for iOS/Android using the Flutter development framework.\nFlutter SDK & Dart programming language\nExperience with mobile platforms like Android/iOS\nFlutter widgets for iOS & Android\nParticipation in the process of analysis, designing, implementation, and testing of new apps\nDeveloping mobile applications in Flutter\nApply industry standards during the development process to ensure high quality\nKey Skills:\nUI: Material design, Material animations, Custom components, User Interaction(touches, gestures)\nCore: Dart, Multithreading, FlutterPub, Rx Dart, Job Queue,\nCommunication & Networking: HTTP, REST, Dio, Cached Network Image, Firebase, Socket, JSON, XML, SMS, Bluetooth, NFC\nBuild: Pubspec, Gradle, info.plist\nWork Experience:\n\nMin. 2 Years\n\nEmployment Type:\n\nFull Time",
    "title": "Flutter Developer",
    "required_skills": []
  },
  {
    "id": "jd_000082",
    "text": "Full Stack Developer\n\nhighlight full stack developer ideal candidate responsible developing custom application using react javascript cs node mongodb ideal applicant able thrive highly collaborative workplace actively engage development process responsibility develop functional fast-responsive web application using markup language troubleshoot user interface improve performance accordingly detect fulfill front-end back-end requirement consistently develop deliver high-quality low-defect feature schedule qualification 2+ year proven experience software developer using react javascript cs html node understanding software quality assurance principle continuous integration ability perform several task time communication skill collaborate customer development ba qa csm desired skill previous experience scrum/agile environment mongodb experience",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000083",
    "text": "Database Administrator\n\ndatabase administrator & developer database administrator/developer full-time position primarily responsible maintenance production microsoft sql server database server development coding deployment web report persisted datasets reporting system data visualization tool biopharmaceutical environment responsibility include create stored procedure function trigger t-sql code satisfy application customer requirement write ad-hoc query end-users extracting data light manufacturing laboratory information system denormalized data store design develop report using sql server reporting service work development team address bug fix enhancement request perform code review analyze execution plan refactor inefficient sql code contribute development maintenance transactional data warehouse system participates 24x7x365 call support rotation well evening weekend maintenance deployment cycle needed assist development team migrating database change test production server assist data analyst data curation ad-hoc reporting request minimum skill experience 4 year work experience relational database system 2 year experience bachelor ’ degree computer science engineering life science demonstrated competency writing code using development tool within microsoft sql server product suite demonstrated competency using database reporting tool ssrs preferred may substituted tableau crystal report experience working pharmaceutical biotechnology laboratory work environment preferred laboratory information management system lims experience preferred manufacturing system would appropriate substitute proficiency linux-based database platform desirable required roche 94000 people across 100 country pushing back frontier healthcare working together ’ become one world ’ leading research-focused healthcare group success built innovation curiosity diversity roche equal opportunity employer information technology information technology > architecturesan jose roche 94000 people across 100 country pushing back frontier healthcare working together ’ become one world ’ leading research-focused healthcare group success built innovation curiosity diversity roche equal opportunity employer strictly prohibits unlawful discrimination based upon individual ’ race color religion gender sexual orientation gender identity/expression national origin/ancestry age mental/physical disability medical condition marital status veteran status characteristic protected law",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000084",
    "text": "Software Engineer\n\nResponsibilities\nDevelop functional and design specifications for server components of system management solution. These features and capabilities range from appliance management, configuration, HA cluster formation, bring-up of various management services, synchronize services' state across controllers in a cluster, manage bring-up of embedded database, ensure security capabilities are adequate.\nDevelop server components in Java and related technologies.\nAnalyze the performance characteristics of back-end modules. Identify inefficiencies and bottlenecks. Propose, implement and test fixes.\nCreate implementation and test plans. Develop software and implement test cases according to these plans.\nEnsure that work is completed on time to meet the business requirements by following procedures for source code control, unit testing, end-to-end testing, and design documentation\nEnsure the stability and scalability of new features and the interoperability with pre-existing system architecture. Collaborate with other developers to select appropriate design solutions.\nCommunicate effectively with individuals of varying technical abilities and professional backgrounds\nQualifications\nMaster’s or Bachelor’s degree in Computer Science, Mathematics or similar field.\n4+ years of development experience designing and implementing web based backend components in JAVA.\nStrong working experience with Linux OS, OS creation and configuration of packages, such as Tomcat, databases such as Postgres.\nStrong knowledge of platform management, device configuration and management for both physical and virtual appliances.\nOutstanding skills with Java and Script development in Linux development environment.\nStrong system level knowledge of building databases, OS, OVF, Tomcat, libcurl, SSL technologies.\nPrior experience of using APIs and developing APIs of different kinds including REST\nPrior experience in Storage, Network, and/or System Management is a plus.\nDevelopment experience designing and implementing backend components in Go is a plus\nExcellent verbal, written, and communications skills\nAbility to handle multiple concurrent activities and have a flexible, positive attitude",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000085",
    "text": "Machine Learning\n\nWe use machine learning at the very core of the platform to personalize incredible candidate experiences; recommend, inform and provide predictions to Talent Acquisition professionals. Machine Learning / Data Engineers are responsible for full lifecycle development including exploration, design, architect, validation and management. Team members lead the product platform by creating new capabilities through AI/ Machine Learning that are exploited in various throughout the platform.\nKey responsibilities of the role include:\n· Create tools and systems that will make our team more scalable\n· Troubleshoot technology problems in the line of collection and delivery\n· Monitor and track project performance against set goals and objectives\n· Work and communicate effectively with other departments, IT professionals, and other colleagues\n· Keep up-to-date on edge technology\n· Lead individual projects priorities, deadlines and deliverables using AGILE methodologies\n· Deliver high efficiency, high availability, fault tolerant software systems\n· Work with product management and business users to define the roadmap for the product\n· Design and develop innovative solutions to complex problems, identifying issues and roadblocks\n· Be a leader with vision and a partner in brainstorming solutions for team productivity, efficiency, training and motivating developers, and hiring new\nQualifications:\n· Ideally, experience working in a data-centric team or organization that delivers or manages data assets\n· Good analytical, mathematical and problem solving skills\n· Experience leveraging open source data\n· Experience working with and/or creating APIs and web services integrating data into larger platform\n· Exposure to AWS (preferred) or other Cloud platforms\nSkills required include:\n· Excellent knowledge of Java (preferred), Scala or Python\n· Excellent knowledge of Apache Spark, other libraries used in conjunction and associated capabilities of the platform.\n· Ability to catalog, locate and identify patterns and anomalies in large datasets\n· Database experience (SQL, DDL/DML, performance tuning, data modeling).\n· Good understanding of UNIX/LINUX environments.\n· Experience with relational and non-relational databases\nPersonal characteristics\n· High learning agility\n· Introspective and self-aware\n· Not afraid of failure and demonstrated ability to learn from past experience\n· Perform diverse and complex tasks with accuracy and attention to detail.\n· Communicate effectively both verbally and in writing, particularly with global colleagues.\nApplication Deadline: 20/12/2020\nExpected Start Date: 31/12/2020\nJob Type: Full-time\nSalary: ₹1,000,000.00 - ₹2,000,000.00 per year\nSchedule:\nDay shift\nExperience:\nMachine Learning: 3 years (Required)\nwork: 3 years (Required)\ntotal work: 3 years (Required)\nEducation:\nBachelor's (Preferred)",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000086",
    "text": "Database Administrator\n\nsummary directly support lending management facilitation participation purchase transaction establishing managing network lead lender potential participation purchase accountable underwriting portfolio purchased participation transaction presenting credit recommendation lending management facilitating loan closing servicing booked participation contributes effective risk management obtaining executed loan document performing ongoing due diligence monitoring lead lender performing collateral administration qualification perform job successfully individual must able perform essential duty satisfactorily requirement listed representative knowledgeskilland/or ability required reasonable accommodation maybe made enable individual disability perform essential function bachelor ’ degree accounting finance similar degree field preferred equivalent progressive work experience in-depth knowledge advanced loan documentation banking law regulation five year ’ proven success sale business development strong focus building relationship five year experience consumer lending and/or underwriting experience commercial lending helpful required humble lack excessive ego concern status quick point contribution others slow seek attention self share credit emphasize team self define success collectively rather individually hungry always looking thing learn responsibility take self-motivated diligent constantly thinking next step next opportunity smart common sense people tend know happening group situation deal others effective way demonstrates good judgment intuition around subtlety group dynamic impact word action essential function direct purchased participation loan network identifying target lead lender ; actively work loan participation establish ongoing contact identified network ensure steady stream potential loan purchase ; establish maintain ongoing due diligence lead lender ; conduct research identify target market originator within market key factor ideal region originator set participation policy annual growth goal directed lending management team ; develop list lead lender gather necessary information conduct due diligence review maintain up-to-date database investment opportunity ; establish ongoing contact network lead lender ; direct loan decision-making process due diligence underwriting lead lender ’ loan package ensure compliance county federal ’ general loan policy product parameter ; contribute sound loan portfolio management ; refine internal process underwriting review booking process support servicing function ; ensure regulatory compliance maintained within purchased participation portfolio ; prepare underwriting credit review present purchased participation management recommended decision ; communicate credit decision approved loan term lead lender ; execute commitment letter participation agreement lead lender ; perform administrative task document review approval ensure proper loan review reporting ; provide credit administration ensuring proper documentation closing loan transaction conducting ongoing account monitoring ; order obtain review approve pre-closing requirement arrange funding date lead lender determine necessary closing loan document obtain draft signed loan document lead lender ensure loan document reviewed approved lending management legal counsel notify lead lender documentation concern ; coordinate funding participation provide instruction fund ; collect fee lead lender ; coordinate ongoing servicing delinquency monitoring purchased participation pool lead lender ; schedule maintain ongoing credit review purchased participation knowledge skill ability strong knowledge experience reporting database strong analytical skill ability collect organize analyze disseminate significant amount information attention detail accuracy ability work cross-functionally employee level organization innovative strategic thinker excellent analytical problem solving project management skill exceptional communication presentation skill effective working consultant vendor outside agency ability work independently team member using discretion decision making sound judgment problem solving effective oral written communication skill relationship management coaching collaboration skill continuous learner unafraid champion new different idea determination see physical requierments physical demand described representative must met employee successfully perform essential function job reasonable accommodation may made enable individual disability perform essential function full-time hour required additional work hour necessary accomplish objective goal project regularly required talk hear frequently required sit ; use hand finger able handle feel reach hand arm occasionally required stand walk occasionally lift and/or move 10 pound specific vision ability required job include close vision color vision ability adjust focus eeo statement sccfcu doe discriminate employment opportunity practice basis race color religion creed sex national origin age disability marital status pregnancy childbirth breastfeeding related condition ancestry medical condition including genetic characteristic veteran military status sexual orientation gender expression person holding undocumented “ ab ” 60 ” driver ’ license characteristic protected law provision also includes perception anyone ha characteristic associated person ha perceived one characteristic discrimination unlawful _this job description exclusive exhaustive list job function employee position may asked perform time time santa clara county federal credit union reserve right revise change job duty responsibility need arises._",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000087",
    "text": "Java Developer\n\nJob Title: Java Developer\nExperience: Senior (6+ Years) - 4 Numbers & Architect (10+ Years) - 2 Numbers\nLocation: Coimbatore-641012\nNotice Period: Immediate or 15 days\nRequirements:\nBachelor’s degree in Software Engineering or Computer Science.\nPrevious work experience as a Software or Java Architect.\nAdvanced knowledge of software architecture.\nProficiency with Java, Java Beans, Java Servlets, and JavaScript.\nExperience with the design and implementation of software networks.\nExperience with software design and web programming.\nHigh-level project management skills.\nAbility to solve complex software system issues.\nGood communication skills.\nJob Type: Full-time\nSalary: ₹1,200,000.00 - ₹2,500,000.00 per year\nSchedule:\nDay shift\nMorning shift\nExperience:\nJava: 4 years (Preferred)\nEducation:\nBachelor's (Preferred)",
    "title": "Java Developer",
    "required_skills": []
  },
  {
    "id": "jd_000088",
    "text": "Database Administrator\n\nwilshire associate incorporated global investment advisory firm offer customized institutionally based solution meet investment need client wilshire fund management wfm division wilshire associate incorporated dedicated provide customized investment solution area asset allocation manager research portfolio construction risk management seeking identify senior database developer join operation technology team successful candidate responsible analysis design developing complex system application portfolio management process individual involved aspect project life cycle includes design programming testing implementation maintenance documentation she/he provide support business system developing maintaining enhancing existing web client based application re-engineering program conform system change solving complex customer third party data key responsibility database installation upgrading database management tuning monitoring performance database optimization database backup recovery restoration process implementation administration user database permission creation technical documentation desired skill background bachelor advanced degree computer science 0-3 year experience programming experience transact sql sql server knowledge sql server 2008/2014/2017 knowledge microsoft ssms ssrs ssis experience implementing maintaining tuning deploying development production environment experience creating table view stored procedure function concept database system security principle practice database administration dba principle practice research methodology data analysis etl data analysis experience offer international dynamic entrepreneurial work environment competitive compensation package including bonus opportunity 3 week vacation 8 paid holiday per year 401 k /roth 401 k /medical/dental/vision & life insurance visit www.wilshire.com additional company information wilshire associate incorporated equal opportunity employer minority/female/disability/veteran wilshire associate incorporated sec registered investment adviser required track certain political contribution rule 206 4 -5 may required disclose prior political contribution phone call required skill required experience",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000089",
    "text": "DevOps Engineer\n\nAbility to stay organized while multitasking in a fast paced environment\nAbility to manage multiple projects with shifting requirements, dates, and priorities\nAbility to coordinate and communicate with teams in multiple time zones globally\nFast paced self-directed learner able to pick up and master new technologies on the fly\nDNS Subject matter expert\nAtleast 5+ years experience administering enterprise BIND instances on large scale\nThorough operational understanding of DNS-sec\nDNS troubleshooting and monitoring experience\nAtleast 5+ years load balancer administration experience\nShould have 8+ years Linux system administration experience\nPython scripting experience\nautomation tooling, Terraform and Ansible\nconsuming REST APIs\nExperience using configuration management tools such as puppet/ansible/chef/terraform to manage large fleet of servers\nEnterprise monitoring experience such as LogicMonitor, Zabbix, icinga, or Splunk\nExperience in 24x7 support role with oncall rotation",
    "title": "DevOps Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000090",
    "text": "Machine Learning\n\nAbout Us:\nCareerNinja is building a personalised & experiential learning platform to make high-quality learning accessible at a mass global scale. It is revolutionising the way youth kickstart & upgrade their career. At the core of it is a unique adaptive learning product with an exclusive technology which enables course creation with 1/10th the effort & cost.\n*\nWhy Work With Us:\nBeing an education organisation, we take your growth seriously. Working with us could be your best decision if you're looking for learning, wide exposure & looking to be in the driving seat of what you do. You will be given real responsibilities, freedom to make decisions and come up with ideas and work closely with the founder and the core team, all in a flexible, casual and young (everyone under 28) work environment.\nWork from home(even without Covid), flexible work, free snacks, etc are just a regular part of our work life.\nMachine Learning Engineer\nWe are looking for an expert in Data Engineering, Machine Learning, Deep Learning and NLP. You will lead all the processes from R&D, data collection, cleaning, and preprocessing, to training models and deploying them to production. The ideal candidate will be passionate about artificial intelligence and stay up-to-date with the latest developments in the field. Most of our work revolves around text data so we need a candidate who has proven expertise in recent advancements in the field of NLP.\nResponsibilities:\nData Collection and Curation.\nSelect appropriate annotated datasets for Supervised Learning methods.\nUse effective text representations to transform natural language into useful features.\nFind and implement the right algorithms and tools for NLP tasks.\nDevelop ML/DL/NLP models according to requirements.\nTrain the developed model and run evaluation experiments.\nPerform statistical analysis of results and refine models.\nExtend ML libraries and frameworks to apply in NLP tasks.\nBuilding recommendation engines to increase the personalization of content for the user.\nTesting and deployment of models on cloud services i.e. AWS/GCP etc.\nAct as a bridge between product and engineering team to translate product requirements into the technical solutions.\nStay updated and use industry best practices and latest technology trends.\nPrototype ideas rapidly using cutting edge technologies, drive architecture discussions, and proposes solutions to system and product changes.\nRequirements:\nBachelors or higher degree in Computer Science or related technical field.\n2+ years of work experience in NLP, Machine Learning, Deep Learning and Data Science.\nStrong experience in developing, deploying and monitoring large scale models in production environments from scratch.\nDeep understanding and working knowledge of frameworks like PyTorch/TensorFlow/Keras.\nStrong Exposure to at least 1-2 state of the art NLP algorithms e.g GPT, BERT, T5, RoBERTa, Hugging Faces etc.\nDeep understanding of NLP techniques for text representation, semantic extraction techniques, data structures and language modelling.\nExperience with NLP libraries and technologies including Spacy, NLTK, Gensim, Stanford NLP etc.\nProficiency with Python and basic libraries for machine learning such as Numpy, Scikit-learn and pandas.\nExposure to DL Model optimisation and transfer learning technique.\nExperience of cloud environment AWS/GCP, Hadoop/Spark, SQL is a plus.\nExperience with technologies like Docker, Kubernetes, CI/CD, Git is a plus.\nExperience with ML Ops is a plus.\nA team player who can work independently too.\nExcellent written and verbal communication skills.\nMulti-tasking and time-management skills, with the ability to prioritize tasks.\n*\nJob Type: Full-time\nSalary: ₹800,000.00 - ₹1,500,000.00 per year\nExperience:\nMachine Learning: 2 years (Required)\nwork: 3 years (Preferred)\ntotal work: 2 years (Preferred)\nEducation:\nBachelor's (Required)\nWork Remotely:\nTemporarily due to COVID-19",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000091",
    "text": "Backend Developer\n\nWe are looking for an analytical, results-driven Back-end Developer who will work with team members to troubleshoot and improve current back-end applications and processes. The Back-end Developer will use his or her understanding of programming languages and tools to analyze current codes and industry developments, formulate more efficient processes, solve problems, and create a more seamless experience for users. You should have excellent communication, computer, and project management skills.\nTo succeed as a Backend Developer, you should be focused on building a better, more efficient program and creating a better end-user experience. You should be knowledgeable, collaborative, and motivated.\nBack-end Developer Responsibilities:\nCompile and analyze data, processes, and codes to troubleshoot problems and identify areas for improvement.\nCollaborating with the front-end developers and other team members to establish objectives and design more functional, cohesive codes to enhance the user experience.\nDeveloping ideas for new programs, products, or features by monitoring industry developments and trends.\nRecording data and reporting it to proper parties, such as clients or leadership.\nParticipating in continuing education and training to remain current on best practices, learn new programming languages, and better assist other team members.\nTaking lead on projects, as needed.\nBack-end Developer Requirements:\nBachelor’s degree in computer programming, computer science, or a related field.\nMore education or experience may be required.\nFluency or understanding of specific languages, such as Java, PHP, or Python, and operating systems may be required.\nStrong understanding of the web development cycle and programming techniques and tools.\nFocus on efficiency, user experience, and process improvement.\nExcellent project and time management skills.\nStrong problem solving and verbal and written communication skills.\nAbility to work independently or with a group.\nWillingness to sit at desk for extended periods.\nApplication Deadline: 15/11/2020\nJob Type: Full-time\nSalary: From ₹25,000.00 per month\nExperience:\nProgramming: 1 year (Preferred)\nwork: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nNo",
    "title": "Backend Developer",
    "required_skills": []
  },
  {
    "id": "jd_000092",
    "text": "Machine Learning\n\nLocation: Bangalore\nExperience: 4 to 5 year\nEducational Qualification: B.E/B.Tech preferred. Shouldn’t matter if you are great in coding and math.\nEssential Job Functions:\nThe job involves being part of the Research team working to continuously improve Radware Bot Manager’s bot detection engine. The Research Engineer’s role involves exploration and evaluation of different bot detection solutions and then productionalize it.\nJob Requirement:\nExperience with cloud-based ML service.\nR&D to enhance Radware Bot Manager’s bot-human classification engine focusing on novel use cases.\nGuide and collaborate with team members on continuous improvement of the bot detection logic.\nWork with Engineering and Data Science/Data Analysis teams closely to identify challenges and to also build the solution for scalable deployment.\nIf you think you’d fit this role at Radware! Please send your resume to botmanager_careers@radware.com",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000093",
    "text": "JavaScript Developer\n\nTechnology :\nSignificant experience building frontend applications.\nThorough understanding of React.js and its core principles\nProvided solid markup skills in utilizing HTML5, CSS3, JavaScript, and jQuery\nExperienced with technologies such as: React JS, JavaScript Frameworks , JSON, AJAX and Bootstrap\nProficiency with JavaScript(ES6), CSS, HTML5, ReactJS, Redux, jQuery, Nodejs.\nExperience with data structure libraries (e.g., Immutable.js)\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\nProtocols :\nExcellent understanding of common web services protocols e.g. HTTPS, HTTP, JSON, & REST\nExperience with RESTful APIs & API Security\nKnowledge of modern authorization mechanisms, such as JSON Web Token\nUX Design :\nEnsure the technical feasibility of UI/UX design\nExperience with designing user interfaces and enterprise dashboards.\nExperience converting a define UX Mockup to UI Delivery\nDesign Pattern :\nDesign, develop user interfaces using JavaScript design patterns, supporting MVC frameworks.\nBasic understanding of how back-end development works.\nKnowledge of designing mark up, developing the UI of websites and/or web applications\nDemonstrated understanding of UX and UI design with an emphasis on maximizing usability\nKnowledge of using REST web services and working with interface design\nFamiliarity of Backend Driven UI approach.\nFamiliarity of UI Design Patterns.\nDeep understanding of Development intricacies of multiple platforms, devices and layouts.\nVery strong in object-oriented concepts & design patterns.\nDevelopment Process :\nFamiliarity with modern front-end build pipelines and tools\nFamiliarity with code versioning tools. (i.e. Git)\nDemonstrable abilities to optimize code. Focus on quality & ability to perform code reviews.\nAbility to guide & develop other team members on technical front.\nStrong analytical skills for effective problem solving.\nExperience with test-driven development and frameworks/technologies to test frontend applications.\nStrong grasp of functional programming patterns and concepts.\n\nCategory : Engineering and Technology\nSubcategory: Software Engineering\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2020-12-10\n\n\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape whats possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
    "title": "JavaScript Developer",
    "required_skills": []
  },
  {
    "id": "jd_000094",
    "text": "Database Administrator\n\nsoftware/systems operation administrator onboard new client hosting infrastructure support client production operation deploying change maintaining hosted infrastructure build maintain qcloud hosted infrastructure hype-v vms window active directory ftp server web server ftp server window fileshares deploy software database change using quorum deployment tool process working quorum support service resource various support task hosted live client environment work software organization troubleshoot application vm resource utilization issue work uphold potentially improve current hosted change management process support audit requirement process sae18/soc1 report implement managed hosted improvement project coordinate offshore team environment creation task deployment change ping monitor alert issue",
    "title": "Database Administrator",
    "required_skills": []
  },
  {
    "id": "jd_000095",
    "text": "Full Stack Developer\n\nsoftware developer - authentication remote possible affinity ? affinity privately held national solution consulting firm based milwaukee serve strategic advisor thought leader high- caliber client client employee value approach company “ big enough complex high impact work small enough truly care ” focus hiring motivated intelligent professional passion work desire grow along u visit website learn u exciting thing affinity www.affinityit.com role ? member identity management team collaborate larger software engineering team design develop test software identity access management solution working agile development environment building state art software solution requirement 5+ year experience web service framework and/or technology java spring springboot rest json experience federated identity management fim experience common development practice including ci/cd pipeline test automation agile development etc experience open-source authentication protocol related technology including openid connect oauth2.0 saml experience third-party iam product ca siteminder pingfederate pingidentity product experience back-end full-stack web development experience relational database development related technology experience directory-based technology ldap experience common development practice including ci/cd pipeline test automation agile development distributed version control etc bachelor ’ degree computer science similar field open minded team player ! offer competitive base salary full benefit including full medical dental 401k pto holiday disability life culture collaboration challenging work contemporary emerging technology opportunity high-impact work respected partner entrepreneurial spirit collaborative performance review career planning personalized training career development opportunity advancement apply contact fulfillment team directly ! jane knaus fulfillment leader direct 310.316.3737 jknaus @ affinityit.com make sure follow u linkedin company page new job posting http //www.linkedin.com/company/265359/",
    "title": "Full Stack Developer",
    "required_skills": []
  },
  {
    "id": "jd_000096",
    "text": "Machine Learning\n\nPosition Title\nData Scientist\n\n01-Oct-2020\n\nJob ID\n303875BR\n\nJob Description\nNovartis Business Services IT (NBS IT) is working to support Novartis to deliver better patient outcomes through innovative use of information and technology. As technology is reshaping the healthcare industry, IT will be a differentiator for our businesses, inspiring new ideas and enabling Novartis to reimagine medicine.\nTo continue to add even greater value for the business we need to have the right people with the right capabilities.\nWe need to be customer-oriented and focus on bringing the best services and solutions to the business – both globally and locally – to support our patients.\nNBS IT offers this extraordinary work experience with a real opportunity to develop in a highly fast-paced technology-driven environment where collaboration and innovation are at the heart of who we are and what we do.\nScience, innovation & technology are central to the Novartis mission of caring & curing patients. We have a clear understanding and deep commitment that IT will be a critical factor in our future success.\n\n•Collaborate in multi-functional teams to evaluate business activities, and then develop innovative and effective approaches to seek team’s analytics problems and communicate results and methodologies.\n•Ability to initiate and drive projects from conception to completion with minimal direction.\n•Innovates and recommends sophisticated predictive analytics, computational science, Natural Language Processing (NLP), machine learning and deep learning techniques to answer research questions and synthesize insights that achieve business objectives.\n•Establishes scalable, efficient, automated solutions for large scale data analyses, model development, model validation and model implementation. Works to translate prototypes into new products, services, and features and provide guidelines for large-scale implementation.\n•Ability to build and fine tune algorithms that scale up from small-scale proof-of-concept stage to full production systems.\n•Build knowledge artifacts of business problems that were solved with sophisticated analytics techniques which can be published in journals. Excellent quantitative skills and the ability to tell a story using data\n\nMinimum requirements\n•PhD. or Masters from top University in Statistics, Operational Research, Computer Science or in a quantitative field.\n•SQL, Python, R, Scala, Tensor Flow, Pytorch are Mandatory Qlikview/Tableau/Spotfire but not limited to these are good to have\n•2+ years after PHD or 5+ years after Masters\n•In predictive modeling and large data analysis\n•In data querying languages (e.g. SQL), scripting languages (e.g. Python, R, Scala), or deep learning libraries (e.g. tensorflow, pytorch).\n•Expertise in at-least some visualization tools such as Qlikview, Spotfire, Tableau (but not limited to these) for designing insights is good to have\n\nWhy consider Novartis?\n\n799 million. That’s how many lives our products touch. And while we’re proud of that fact, in this world of digital and technological transformation, we must also ask ourselves this: how can we continue to improve and extend even more people’s lives?\n\nWe believe the answers are found when curious, courageous and collaborative people like you are brought together in an inspiring environment. Where you’re given opportunities to explore the power of digital and data. Where you’re empowered to risk failure by taking smart risks, and where you’re surrounded by people who share your determination to tackle the world’s toughest medical challenges.\n\nImagine what you could do at Novartis!\n\nJob Type\nFull Time\n\nCountry\nIndia\n\nWork Location\nHyderabad, AP\n\nFunctional Area\nData Science\n\nDivision\nNBS\n\nBusiness Unit\nIT NBS\n\nEmployment Type\nRegular\n\nCompany/Legal Entity\nNov Hltcr Shared Services Ind\n\nShift Work\nNo",
    "title": "Machine Learning",
    "required_skills": []
  },
  {
    "id": "jd_000097",
    "text": "Wordpress Developer\n\nExposure on Wordpress CMS, JavaScript/ jQuery.\nGood experience with PHP 5+ and MySQL.\nFocused on Object-Oriented Programming (OOP)\nHaving knowledge of LAMP, Version Control(GIT), Hosting\nGood knowledge of XML, XHTML, CSS, Modules i.e. API integration, Payment Gateways, XML with a focus on standards.\nKnowledge of Custom Wordpress plugin development, And Theme Customization.\n\nExperience: 2 to 5 Years\n\nQualification: Any",
    "title": "Wordpress Developer",
    "required_skills": []
  },
  {
    "id": "jd_000098",
    "text": "Software Engineer\n\nVista Equity Partners is the world's leading private equity firm for Enterprise Software and recently invested $1.5B in the Reliance Jio Digital Platform. As part of the Vista portfolio, Integral Ad Science (IAS) is a NYC-headquartered global technology and data company that builds verification, optimization, and analytics solutions for the advertising industry. We are looking for a Java Software Engineer to join our new and fast-growing R&D team in Pune. If you are excited by technology that has the power to handle hundreds of thousands of transactions per second; collect tens of billions of events each day; and evaluate thousands of data-points in real-time all while responding in just a few milliseconds, then IAS is the place for you!\n\nAs a Software Engineer you will build and expand upon the IAS reporting framework and UI for IAS' analytics and reporting software products. You will integrate reports and dashboards into the IAS UI platform and implement critical features in our custom report builder tool using state of the art technologies and tools.\n\nThe ideal candidate has a passion for data analytics and back-end development.\n\nWhat you'll do:\nDesign and develop critical features in our microservice technology stack\nIntegrate with 3rd party APIs and services\nDesign and develop back end Java services and components in our world class custom report builder\nParticipate in agile meetings and daily stand ups\nWork closely with Product teams and other cross-functional teams\nYou should apply if you have most of this experience:\n3-5+ years of recent experience with back end software development\nExperience with Java, Groovy, and SQL\nExperience with persistence APIs such as Hibernate\nStrong understanding of REST and microservice architectures and systems\nExperience with build tools such as Gradle and Maven\nA strong passion for Test Driven Development\nExperience or understanding of AWS services such as EC2, S3, Lamba, and SQS\nUnderstanding of full software development life cycle, agile development and continuous integration\nAbout Integral Ad Science\n\nIntegral Ad Science (IAS) is the global market leader in digital ad verification, offering technologies that drive high-quality advertising media. IAS equips advertisers and publishers with both the insight and technology to protect their advertising investments from fraud and unsafe environments as well as to capture consumer attention, and drive business outcomes. Founded in 2009, IAS is headquartered in New York with global operations in 18 offices across 13 countries. IAS is part of the Vista Equity Partners portfolio of software companies. For more on how IAS is powering great impressions for top publishers and advertisers around the world, visit integralads.com.\n\nEqual Opportunity Employer:\n\nIAS is an equal opportunity employer, committed to our diversity and inclusiveness. We will consider all qualified applicants without regard to race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability or age. We strongly encourage women, people of color, members of the LGBTQIA community, people with disabilities and veterans to apply.\n\nCalifornia Applicant Pre-Collection Notice:\n\nWe collect personal information (PI) from you in connection with your application for employment or engagement with IAS, including the following categories of PI: identifiers, personal records, commercial information, professional or employment or engagement information, non-public education records, and inferences drawn from your PI. We collect your PI for our purposes, including performing services and operations related to your potential employment or engagement. For additional details or if you have questions, contact us at compliance@integralads.com.\n\nTo learn more about us, please visit http://integralads.com/ and https://muse.cm/2t8eGlN\n\nAttention agency/3rd party recruiters: IAS does not accept any unsolicited resumes or candidate profiles. If you are interested in becoming an IAS recruiting partner, please send an email introducing your company to recruitingagencies@integralads.com. We will get back to you if there's interest in a partnership.",
    "title": "Software Engineer",
    "required_skills": []
  },
  {
    "id": "jd_000099",
    "text": "Node js developer\n\nObjective:\nCandidates can look forward to opportunity for software development and engineering as a role in mission-critical software development team including:\nResponsibilities :\nunderstanding mission-critical telecom software requirements;\nassisting in design and engineering;\ndetermining project deliverables;\nfull stack software development;\nengineering back end applications;\nfront end application development;\ndeliveries as per project milestones.\nSkills/Experience:\nunderstanding and experience of telecom standards preferred;\nexperience on SIP, telephony stack development;\nGood communication skills;\nA keen grasp of information technology;\nProfessional demeanor;\nPersonal accountability and strong work ethic;\nProfessional, able to interact with vendors/clients;\nPositive, “can do” attitude.\nQualification:\nB.E. / B.Tech. / B.Sc / B.Eng\nB. IT / B.Sc [IT]\nJob Type: Full-time\nSalary: ₹20,000.00 - ₹35,000.00 per month\nSchedule:\nFlexible shift\nMorning shift\nExperience:\nnode.js: 2 years (Required)\nWork Remotely:\nNo",
    "title": "Node js developer",
    "required_skills": []
  }
]